from datetime import datetime, timedelta

taisia_dict = {
    "IDList": {
        "ServerID": [
            550054337758494725,
        ],
        "ChatIDs": [
            550054338366537731,  # стенограмма
            743086809130467411,  # академия
            831933308686041158,  # крутилошная
            576404314994638860,  # патефон
        ],
        "UserIDs": [
            846381887224283146,  # Таечка
            476100337355456552,  # Марк
            168327786900094978,  # Антон
            384047909320261633,  # Продаван
            307789015849893888,  # Ганс
            447115912072658961,  # Илья
            691672630696214608,  # Дора
            387848969788588032,  # СД
            533595594862624778,  # Валера
            139070694641238016,  # Вася
        ],
        "VoiceIDs": [
            550054338366537735,  # курилка
            684091924029767690,  # парилка
            576405829960597512,  # тандем
            743082924831801365,  # abbey road
            593135560260845569,  # кухня
        ],
        "message_IDs": [
            874323244239450153, #список кейсов
        ],
    },
    "Passports": {
        476100337355456552: {
            "EnterRoom": "MarkEnters",
            "ExitRoom": "MarkExits",
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.2,
            "ExitVolume": 0.2,
            "PreferredName": None,
        },  # Марк
        168327786900094978: {
            "EnterRoom": "anton",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.5,
            "ExitVolume": 0.3,
            "PreferredName": None,
        },  # Антон
        384047909320261633: {
            "EnterRoom": "prodavan",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.5,
            "ExitVolume": 0.3,
            "PreferredName": None,
        },  # Продаван
        307789015849893888: {
            "EnterRoom": ["nikita", "nikita2"],
            "EnterWeights": [1, 9],
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.4,
            "ExitVolume": 0.3,
            "PreferredName": None,
        },  # Ганс
        447115912072658961: {
            "EnterRoom": "Ilya",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.7,
            "ExitVolume": 0.3,
            "PreferredName": None,
        },  # Илья
        691672630696214608: {
            "EnterRoom": "dora",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.7,
            "ExitVolume": 0.3,
            "PreferredName": None,
        },  # Дора
        387848969788588032: {
            "EnterRoom": ["SD", "SD2", "SD3", "SD4"],
            "EnterWeights": [0, 1, 0, 19],
            "ExitRoom": "SDexits",
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.4,
            "ExitVolume": 0.6,
            "PreferredName": "СД ПРИКРОЕТ СПИНУ",
        },  # СД
        533595594862624778: {
            "EnterRoom": "Valera",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.2,
            "ExitVolume": 0.3,
            "PreferredName": None,
        },  # Валера
        419236222347771904: {
            "EnterRoom": "peru",
            "ExitRoom": "peru2",
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.2,
            "ExitVolume": 0.3,
            "PreferredName": None,
        },  # Витя        
        397156462637482017: {
            "EnterRoom": "shishka",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.6,
            "ExitVolume": 0.6,
            "PreferredName": "ахаха шыышка",
        },  # шыышка        
        139070694641238016: {
            "EnterRoom": "bakaboys",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.4,
            "ExitVolume": 0.6,
            "PreferredName": None,
        },  # Вася
        206471691910643713: {
            "EnterRoom": "sanya",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.3,
            "ExitVolume": 0.1,
            "PreferredName": None
        }, # Саня        
        197163728867688448: {
            "EnterRoom": "onion_2",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.3,
            "ExitVolume": 0.1,
            "PreferredName": None
        }, # Лучок        
        263683843549167626: {
            "EnterRoom": "bagrov",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.5,
            "ExitVolume": 0.1,
            "PreferredName": None
        }, # багров        
        701044847519465532: {
            "EnterRoom": "bagrov",
            "ExitRoom": None,
            "last_activity": datetime.now() - timedelta(minutes=5),
            "EnterVolume": 0.5,
            "ExitVolume": 0.1,
            "PreferredName": None
        }, # компьютер багров
    },
    "TaisiaName": (
        "Таечка, ",
        "Тая, ",
        "Тася, ",
        "Таися, ",
        "Таюня, ",
        "Тай, ",
        "Хентаечка, ",
        "Душа моя, ",
        "Душенька, ",
        "Таяна, ",
        "Таюшка, ",
        "Хозяйка, ",
        "Таюш, "
    ),
    "FullNameList": (
        "Я, конечно, люблю свою бабушку, но с тех пор, как меня назвали в её честь, я не воспринимаю полную форму собственного имени.",
        "Не люблю эту форму своего имени.",
        "Не называй меня так, пожалуйста.",
        "Мне что, семьдесят?",
        "«Таечка» would be fine, thanks.",
        "Ещё скажи «Таисия Андреевна», боже.",
        "Я не «Таисия»!",
    ),
    "andreevna_list": (
        "О боже...",
        "Я теперь жалею, что сказала...",
        "Кринж.",
        "Ой.",
        "Как официально...",
        "Как-то токсичненько.",
    ),
    "TaisiaCAPS": (
        "ТАЯ, ",
        "ТАЕЧКА, ",
        "ТАИСИЯ, ",
        "ХЕНТАЕЧКА, ",
        "ТАЯНА, ",
        "ТАЙ, ",
        "ТАЮШКА, ",
        "ТАСЯ, ",
        "ТАЮНЯ, ",
        "ХОЗЯЙКА, ",
    ),
    "CAPSReaction": (
        "Не кричи на меня.",
        "Не надо на меня кричать.",
        "Чего кричишь?",
        "Тише, не кричи.",
        "А теперь всё то же самое, но спокойным тоном. Спасибо.",
        "Я не люблю, когда на меня кричат.",
        "Тише, тише, я слышу.",
        "Ну не кричи, пожалуйста.",
        "Громко.",
        "Отожми капс, пожалуйста.",
    ),
    "not_a_capital_list": (
            "Имена пишутся с большой буквы!",
            "Прояви немного уважения.",
            "Если у тебя сломался шифт, поищи запасной в правой части клавиатуры."
        ),
    "no_comma_list": (
            "Обращения выделяются запятыми!",
            "Дарю купон на сотню запятых, не стесняйся пользоваться!",
            ",",
            "Что за набор слов...",
        ),
    "TaisiaActivities": {
        "playing": [
            "ящик.",
            "бисер.",
            "ЖИЗНЬ.",
            "Deus Ex",
            "Control",
            "Agar.io",
            "любовь.",
            "HuniePop",
            "Evenicle",
            "Minecraft",
            "Overwatch",
            "Far Cry 5",
            "GeoGuessr",
            "Undertale",
            "Arknights",
            "Azur Lane",
            "L.A. Noire",
            "The Sims 4",
            "Pathologic",
            "To The Moon",
            "Tell Me Why",
            "Angry Birds",
            "Flappy Bird",
            "фингербокс.",
            "Don't Starve",
            "Rogue Legacy",
            "Honey Select",
            "Happy Wheels",
            "Shovel Knight",
            "Rocket League",
            "Hotline Miami",
            "Stardew Valley",
            "Капитан Коготь",
            "Cookie Clicker",
            "Papers, Please",
            "Genshin Impact",
            "Mortal Kombat 9",
            "DEATH STRANDING",
            "Life is Strange",
            "Resident Evil 2",
            "Monument Valley",
            "Alien: Isolation",
            "Бесконечное лето",
            "Kantai Collection",
            "This War of Mine",
            "The Outer Worlds",
            "BioShock Infinite",
            "League of Legends",
            "The Wolf Among Us",
            "Plants vs. Zombies",
            "Fallout: New Vegas",
            "The Darkest Dungeon",
            "Little Nightmares 2",
            "Conker's Bad Fur Day",
            "The Sims: Makin' Magic",
            "Ori and the Blind Forest",
            "Doki Doki Literature Club!",
            "The Elder Scrolls V: Skyrim",
            "Grand Theft Auto: Vice City",
            "Animal Crossing: New Horizons",
            "The Binding of Isaac: Repentance",
            "LEGO Star Wars: The Complete Saga",
            "Dream Daddy: A Dad Dating Simulator",
            "Vampire: The Masquerade — Bloodlines",
        ],
        "listening": [
            "Мы — Остров",
            "подкастики.",
            "alt-J — Taro",
            "Акиру Ямаоку.",
            "ASMR с ютуба.",
            "дрель соседа.",
            "Eminem — Stan",
            "GSPD — Эйфория",
            "Muse — Hysteria",
            "Mirèle — Россия",
            "что-то из KMFDM.",
            "Xiu Xiu — Daphny",
            "Кровосток — Дети",
            "Земфира — Ромашки",
            "Mujuice — Пустошь",
            "Placebo — Swallow",
            "сюиты Чайковского.",
            "какой-то найткор.",
            "раннего Елизарова.",
            "ЛАУД — Cold Weapon",
            "Radiohead — Pearly*",
            "Lana Del Rey — 1949",
            "Coil — Tattooed Man",
            "Lil Peep — lil jeep",
            "Nirvana — Love Buzz",
            "Гольдберг-вариации.",
            "романсы Рахманинова",
            "Джизус — ТЫ В ПРОШЛОМ!",
            "Palaye Royale — Lonely",
            "последнего Джо Рогана.",
            "Хаски — На что я дрочу",
            "Electric Six — Gay Bar",
            "Harry Nilsson — Coconut",
            "Дудя с каким-то рэпером.",
            "KISS — Fits Like A Glove",
            "Earth, Wind & Fire — Mom",
            "Boulevard Depo — Carousel",
            "Егор Летов — Как листовка",
            "Буерак — Страсть к курению",
            "Iggy Pop — Chocolate Drops",
            "Oxxxymiron — Девочка Пиздец",
            "Led Zeppelin — Heartbreaker",
            "прошлогоднего Контрапоинтс.",
            "The Prodigy — Molotov Bitch",
            "Queen — My Melancholy Blues",
            "Death in June — The Trigger",
            "Alain Souchon — Rive Gauche",
            "Guns N' Roses — This I Love",
            "Duran Duran — The Chauffeur",
            "David Bowie — Word on a Wing",
            "Crystal Castles — Untrust Us",
            "teen suicide — haunt me (x3)",
            "прыгай киска — райан гослинг",
            "Комсомольск — Чёрный квадрат",
            "Pink Floyd — Wish You Were Here",
            "Royal Blood — Ten Tonne Skeleton",
            "Poets of the Fall — Late Goodbye",
            "The Kinks — A Well Respected Man",
            "BONES — WhiteTrashMidwesternTown",
            "Rainbow — The Temple of the King",
            "Gary Glitter — Rock & Roll Part 2",
            "Евгений Понасенков — I Love Paris",
            "Psychic TV — Burning the Old Home",
            "саундтреки с последнего «Оскара».",
            "Queens of the Stone Age — Kalopsia",
            "Lera Lynn — My Least Favorite Life",
            "Low Roar — Nobody Loves Me Like You",
            "Bauhaus — Terror Couple Kill Colonel",
            "Red Hot Chili Peppers — Suck My Kiss",
            "Godspeed You! Black Emperor — Static",
            "Eddie Money — Two Tickets to Paradise",
            "Lil Nas X - MONTERO (Call Me By Your Name)",
            "The White Stripes — One More Cup of Coffee",
            "Ennio Morricone, Joan Baez — Here's To You",
            "King Gizzard & The Lizard Wizard — East West Link",
            "Halsey — The Lighthouse",
            "System Of A Down — Soldier Side",
        ],
        "watching": [
            "томно.",
            "вдаль.",
            "в оба.",
            "в пол.",
            "волком.",
            "на вас.",
            "свирепо.",
            "тиктоки.",
            "свысока.",
            "куда-то.",
            "украдкой.",
            "Твин Пикс.",
            "осуждающе.",
            "в пустоту.",
            "не пялясь.",
            "вам в рот.",
            "и смотрит.",
            "за салоном.",
            "недовольно.",
            "вам в глаза.",
            "3кликфилипа.",
            "за порядком.",
            "благосклонно.",
            "свои мюзиклы.",
            "в крутилошную.",
            "с недоумением.",
            "не вмешиваясь.",
            "сквозь пальцы.",
            "списки гостей.",
            "скидки в Стиме.",
            "ножи по скидке.",
            "недавние демки.",
            "за посетителями.",
            "цены золотых РМР.",
            "очередной сериал.",
            "на свои ноготочки.",
            "раскид на Оверпассе.",
            "за поведением Никиты.",
        ],
    },
    "TopicList": [
        "Что жъ, иногда противникамъ просто очень везетъ.",
        "Луна сегодня особенно красива, не такъ ли?",
        "Жуйте какъ слѣдуетъ.",
        "Стать зрѣлымъ мужемъ — это значитъ снова обрѣсти ту серьезность, которою обладалъ въ дѣтствѣ, во время игръ.",
        "Тотъ, кто терроризируетъ другихъ, самъ живетъ въ постоянномъ страхѣ. — Клавдій ​Клавдіанъ​",
        "Все потому что ​Дора​ — дура, суперъ-дура, ​Дора​ — дура",
        "Замѣчательный день сегодня. То ли чай пойти выпить, то ли повѣситься.",
        "Что наша жизнь? — Игра!",
        "Работа — это то, что человѣкъ обязанъ дѣлать, а Игра — то, чего онъ дѣлать не обязанъ.",
        "Человѣкъ — играющее животное.",
        "Удивительно, что можетъ сдѣлать одинъ лучъ солнца съ душой человѣка!",
        "Выигравшій никогда не скажетъ: «Это всего лишь игра».",
        "Человѣкъ бываетъ вполнѣ человѣкомъ лишь тогда, когда играетъ.",
        "Игра — высшая форма изслѣдованія.",
        "Уроды будутъ сосать...",
        "Вотъ жизнь-то! Живемъ въ одномъ городѣ, почти рядомъ, а увидишься разъ въ недѣлю, и то въ церкви либо на дорогѣ, вотъ и ​все! Здѣсь что вышла замужъ, что схоронили — ​все​ равно.",
    ],
    "ReasonList": [
        "Захотела.",
        "Возжелалось.",
        "Так лучше.",
        "А что, плохо, что ль?",
        "Чтоб не скучали!",
        "Нужно.",
        "Зачем-то...",
        "По бабьей глупости!",
        "Пусть так.",
    ],
    "WrongRythm": (
        "Музыку заказывают в патефоне.",
        "Прошу, в следующий раз отправь запрос в «патефон».",
        "А патефон для кого?",
        "Этот канал не предназначен для заказа музыки.",
        "В патефон!",
        "Здесь не заказывают музыку.",
        "Не засоряй канал нерелевантными запросами, пожалуйста.",
        "Для музыкальных запросов есть патефон. Спасибо!",
    ),
    "sus_error": [
        "Вы хотели, чтобы я отслеживала жулика? Не вижу ссылочки.",
        "За кем следить-то?",
        "Я готова следить. Но за кем?",
        "Мне бы ссылочку формата «steamcommunity.com/profiles/<циферки>» или с id...",
        "Я всё запишу, но мне бы корректную ссылочку!",
        "Я отслеживаю через Стим, на него и нужна ссылка.",
    ],
    "WelcomeList": [
        "Рада видеть тебя,",
        "Привет,",
        "Здравствуй,",
        "Добро пожаловать,",
        "А вот и",
        "Я ждала тебя,",
        "Я знала, что ты придёшь,",
        "Привет-привет,",
        "А я всё думала, когда же ты появишься,",
    ],
    "WelcomeList2": [
        "! Ну и никнейм.",
        "! Надеюсь, ты любишь контрстрайк.",
        "! Веди себя хорошо, хорошо?",
        ".",
        "! Ты меня не знаешь, но о тебе я представление имею.",
        "! Надеюсь, у вас нет проблем с лудоманией.",
        "! Искренне рада тебя видеть.",
    ],
    "GoodbyeList": [
        "Наши ряды покинул",
        "На сервере почему-то не стало",
        "В салоне на одного меньше — от нас ушёл",
        "Куда-то ушёл",
        "Ой, пропал",
        "С нами больше нет",
    ],
    "GoodbyeList2": [
        "Надеюсь, всё хорошо!",
        "",
        "А как же мы..?",
        "Так и должно быть?",
        "Может, и к лучшему.",
        "Бросил нашу философскую жизнь... ради баб!",
    ],
    "MentionList": [
        "Ну чего?",
        "Тут я, тут.",
        "Да, я здесь.",
        "Да?",
        "Я немного занята.",
        "Извините, общение с посетителями в мои обязанности не входит.",
        "Давайте в другой раз.",
        "Мне сейчас не с руки.",
        "Не отвлекайте меня, пожалуйста.",
        "А я что?",
        "Меня отвлекают упоминания в Дискорде, предпочитаю откликаться на собственное имя.",
        "А что это сразу «Таечка»?",
        "А я тут при чём?",
    ],
    "BadHabitList": [  # «Тая..?»
        "Ась?",
        "Чего «Тая»?",
        "Я тут, чего такое?",
        "Да?",
        "Тая, Тая.",
        "На месте!",
        "Я здесь!",
        "Я живая, я легитимная!",
    ],
    "MapsEmoji": [
        "<:Inferno:836730674588155904>",
        "<:DustII:836731391860277248>",
        "<:Mirage:836730674480283708>",
        "<:Nuke:836731638787473418>",
        "<:Vertigo:836732851307282462>",
        "<:Overpass:836730674387353630>",
        "<:Office:836730674416844800>",
        "<:Train:836730674701402133>",
        "<:Cache:836730674764447797>",
        "<:Ancient:839188694631055390>",
        "<:Anubis:1043425411750703155>",
        "👍🏻",
    ],
    "map_bans_list": [
        "Здесь можете запретить одну из выбранных карт.",
        "Куда НЕ хотим?",
        "Если куда-то особенно не хочется, можете дать мне об этом знать тут.",
        "...а тут можно запретить чей-то выбор!",
        "У вас шанс исправить чью-то ошибку.",
        "Покумейкайте, что запретить: передумать не дам!",
    ],
    "GreetList": [
        "Голосование!",
        "Ох, опять?",
        "«Кс без пива — весь спрей мимо». Извините...",
        "Жду ваших голосов.",
        "Вы знаете правила.",
        "Грамотный выбор карты — уже половина победы.",
        "И никаких Гриндов.",
        "Господа, голосуем!",
        "Голосуй или проиграешь!",
        "Принимаю ваши голоса.",
        "Вам играть, не мне.",
        "Что наша жизнь? — Игра!",
        "С каждого по голосу!",
        "Кто наши оппоненты? — Они всего лишь девки!",
        "Нет, не просите, «Basalt» не добавлю.",
        "Пожалуйста, голосуем.",
        "А давайте вы проголосуете за свою третью любимую карту?",
        "«Подумав — решайся, а решившись — не думай».",
        "Выберите, на какой карте вы бы хотели провести ближайшие сорок минут.",
        "«Мы не можем изменить то, откуда мы пришли. Но мы можем выбрать, куда идти дальше».",
        "Кант писал, что разумный выбор невозможен без понимания, без чего можно обойтись.",
        "Выбирайте с умом!",
        "Помните: любой «шуточный» Офис обладает вероятностью в как минимум 20%. А играть вам!",
        "Давно не было пыли...",
        "Пятый проголосовавший закрывает голосование — только убедитесь, что вы действительно пятый!",
        "«Мы выбираем, нас выбирают, как это часто не совпадает!»",
    ],
    "Left2VoteList": [
        "Рассчитываю на голоса от:",
        "Жду голоса от:",
        "Ещё не проголосовали:",
        "Хотят на Basalt:",
        "Не выбрали карту:",
        "Ждём этих господ:",
        "_С укором смотрит на_:",
    ],
    "AllVotesSentList": [
        "Все проголосовали, спасибо!",
        "Все голоса учтены!",
        "Всех записала!",
        "Ставки сделаны, ставок больше нет!",
        "Благодарю за оперативные ответы!",
        "Все на месте спортсмены!",
        "Lock'n'load!",
        "Отряд собран!",
        "Демократия — это равенство их голосов."
    ],
    "ErrorList": [
        "Но ведь... Никто ещё не проголосовал.",
        "Дождись голосов, глупый.",
        "Я так понимаю, идём на Basalt.",
        "Мне нужен хотя бы один голос..",
        "Сначала выбери карту. Пожалуйста.",
        "Сначала выбери карту.",
        "Без выбранных карт мне и предложить нечего..",
        "Дай господам проголосовать, хорошо?",
    ],
    "DepartingList": [
        "Пусть будет ",
        "А давайте ",
        "Идём на ",
        "А не пойти ли вам на ",
        "Выпал ",
        "Поздравляю с ",
        "Готовьтесь к ",
        "Отправляйтесь на ",
        "На сей раз ",
        "_<барабанная дробь>_ . . . ",
        "Кто-то выбрал ",
        "Ваша карта ",
        "Хорошо вам повеселиться на ",
        "Удачи на ",
    ],
    "awaiting_banned_maps": [
        "Все карты участвуют в голосовании!",
        "Пока ещё ни одна карта не была запрещена!",
        "Ожидаю запретов карт — но не настаиваю.",
        "Если решитесь что-то запретить, сообщу.",
    ],
    "presenting_banned_maps": [
        "Эти карты (с вероятностью 99%) не участвуют: ",
        "Каких карт не стоит ждать: ",
        "Эти карты были запрещены: ",
        "Запрещены: ",
        "Здесь буду выписывать запрещённые карты: ",
        "Ни одна из этих карт не должна выпасть: ",
        "Вы отказались от: ",
        "Скорее всего, эти карты не выпадут: ",
    ],
    "here_or_everyone_tagged": [
        "Ой, так уведомления приходят всем, не надо так.",
        "Избегай, пожалуйста, обращения сразу ко всем.",
        "Уверена, тебя интересовали далеко не все, кто онлайн, поэтому... Больше не тегай всех.",
        "Пожалуйста, избегай излишних тегов: это раздражает непричастных и редких гостей.",
        "Лучше потрать дополнительные шесть секунд и напиши никнеймы нужных людей, к чему тревожить всех?",
        "...а тебя не бесят уведомления, которые даже не направлены конкретно в твой адрес? Думаю, остальных бесят.",
        "Не знаю, зачем обращаться ко всем тут, но ты в том числе тегнул лично меня, к чему? Обращайся более... адресно. Спасибо.",
        "Не надо так, в салоне больше трёх дюжин человек, уведомления придут всем. Многих раздражает."
    ],
    "deleting_here/everyone_list": [
        " Удаляю это безобразие.",
        " Удалю, пока ты всех не потревожил.",
        " Не беспокойся, удалю за тебя.",
        " Я исправлю эту ошибку, секунду...",
        " Сейчас почищу.",
    ],
    "MarkList": [
        "Он занят.",
        "Хватит дёргать Марка...",
        "Хватит отвлекать Марка!",
        "Мне кажется, он занят.",
        "Что-то срочное? Могу с ним связаться... по своим каналам.",
    ],
    "will_not_exit": [
        "Эм... Нет?",
        "Белены объелся?",
        "Нет.",
        "...что ты сейчас сказал?",
        "Не пойду я никуда.",
        "Хорошая попытка, даже забавная, но нет.",
        "Ты меня прогнать не можешь. А вот я тебя...",
        "А меня-то за что?",
    ],
    "BarrelRollList": [
        "._. |: .–. :| ._.",
        ":airplane_small:",
        "Сам сделай!",
    ],
    "thanks_list": [
        "Не за что!",
        "^^",
        "Ня.",
        "Обращайся.",
        "На здоровье.",
        "К вашим услугам.",
        "Рада помочь.",
        "Тебе спасибо.",
        "<3",
        ":relieved:",
        ":smiling_face_with_3_hearts:",
        ":sunglasses:",
    ],
    # "CuckqueanList": [
    #     "М.",
    #     "Я здесь явно лишняя.",
    #     ". . .",
    #     "Может, я пойду?",
    #     ":eyes:",
    #     "?choose другой_салон",
    #     "Хорошо, хорошо...",
    #     "Круто, круто.",
    #     "Может, эта штука и будет вам карты выбирать?",
    #     "Я, конечно, многое могу понять...",
    #     "Почему эта штука ещё стоит в салоне?",
    #     "И вот зачем?",
    #     "Ага.",
    # ],
    "CuckqueanList": [
        "Я тоже так умею, между прочим.",
        "Почему меня не попросили?",
        "В следующий раз обращайтесь ко мне.",
        "Да он колоды в киоске заряжает!",
        "Его результаты нелегитимны, держите верный.",
        "Вот вам честный результат.",
        "Я тоже понимаю «choose»!",
    ],
    "RythmCuckquean": [
        "Однажды я тоже смогу играть вам музыку :pleading_face:",
        "Надеюсь, когда-нибудь, когда вам захочется послушать музыку, вы обратитесь ко мне — и я смогу вам помочь.",
        "Toucher! Так я не умею.",
        "Иногда я заказываю музыку себе, но Ритм не воспринимает мои команды. Приходится стыдливо удалять сообщения.",
        "Ритм крутой. Правда.",
        "Я часто возвращаюсь к изучению команд Ритма. Такой функционал...",
        "А представьте, как было б круто иметь собственного музыкального бота!",
        "Ой, он ищет с Ютуба? И *стримит* в голосовой канал?!",
    ],
    "TaisiaNameChange": [
        "Не надо менять моё имя, спасибо.",
        "Мне и «Таечка» нравилась.",
        "Моё имя меня полностью устраивало.",
        "Больше не меняй моё имя, хорошо?",
    ],
    "Toxicity": [
        "мать ебал",
        "пошел в пизду",
        "соси хуй",
        "отъебись",
        "заткнись",
        "съеби",
        "пошла ты нахуй",
        "пошла ты на хуй",
        "пошёл ты на хуй",
        "пошел ты на хуй",
        "пошёл ты в пизду",
        "пошел ты в пизду",
        "пошла ты в пизду",
        "пошел на хуй",
        "пошла на хуй",
        "пошёл нахуй",
        "пошла нахуй",
        "пошёл на хуй",
        "пошёл в пизду",
        "пошла в пизду",
        "пашел нахуй",
        "пашёл нахуй",
        "иди в пизду",
        "маня",
        "петушок",
    ],
    "simpicList": [
        "Традиционный прогноз от Саши Симпла!",
        "Напоминаю.",
        "Это счастливый Саша Симпл, он появляется лишь каждое четвёртое голосование, что примерно соответствует вашему винрейту. Это хороший знак!",
        "А вот что об этом думает Саша Симпл:",
        "Голос Саше Симплу!",
        "Лайкните Симпла — и катка пройдёт хорошо!",
        "Я связалась с Сашей Симплом, он просил передать:",
        "Помните, что говорил Саша Симпл:",
        "Also sprach Sasha E1nfach",
        "Равняйтесь на Сашу Симпла!",
        "Это же Саша Симпл!",
    ],
    "openingwrongchannel": [
        "Лудоманить — в крутилошной!",
        "Извини, по просьбе Антона азартные игры перенесены в крутилошную.",
        "Я бы открыла тебе контейнер, но не в этом канале.",
        "Повтори запрос в крутилошной — открою.",
        "Не нужно тут флудить. Для открытия контейнеров и прочей содомии есть крутилошная.",
        "Здесь не крутят!",
        "Хорошо, но давай не тут?",
        "Что, прямо тут?",
        "Пошли в крутилошную!",
        "В крутилошную.",
        "Лимит азартных игр вне крутилошной исчерпан.",
        "Весьма эгоистично с твоей стороны забивать общий канал кейсами.",
        "Крутить — это в крутилошную.",
        "Господа игроки, прошу пройти в крутилошную.",
        "Всё открою, но — в крутилошной.",
    ],
    "not_in_krtlshn": [
        "Вижу, у тебя нет доступа к крутилошной. Добавила.",
        "...давай лучше в крутилошной? Я как раз тебя туда добавила.",
        "Приглашаю в крутилошную!",
        "Конечно, крутилошная сразу за академией.",
        "...почему ты не в крутилошной? Открыла тебе доступ.",
        "Ой, лудоманам прямая дорогая в крутилошную, она теперь доступна.",
        "Загляни в крутилошную, её двери теперь для тебя открыты.",
        "Го в крутилошную, я создала.",
        "Контейнеры открываю в крутилошной — и туда ты уже приглашён.",
    ],
    "demo_reason_list": [
        "нечто стоящее просмотра",
        "ерунда какая-то",
        "что-то непонятное",
        "случилось... что-то"
    ],
    "<:DustII:836731391860277248>": [
        "Проигрывать тоже надо.",
        "Извините...",
        "Помянем.",
        "Вы сами захотели!",
        "Все вопросы к тому, кто выбрал.",
        "Не забудьте солнцезащитный крем.",
        "Постарайтесь побольше забрать за защиту.",
        "Будет пыльно.",
        "Ни пуха!",
        "Вам, я смотрю, скучно.",
        "«Больше никогда», «больше никогда»...",
        "О как.",
        "«Петуха» в руки — и в «тёмку»...",
        "Не, ну это домашняя карта NoAvans!",
    ],
    "<:Inferno:836730674588155904>": [
        "И это не подкрутка.",
        "Не забывайте: открытие двери слышно на обоих плентах.",
        "Вы, я смотрю, любите эту карту.",
        "Я даже знаю, кто выбрал.",
        "Летим в Италию!",
        "Не обижайте курочек.",
        "Сигнатурочка!",
        "Милая карта!",
        "Не злоупотребляйте молотовыми в окно апартаментов, пожалуйста.",
        "Не отдавайте так просто А!",
        "С итальянского, кстати, «преисподняя».",
        "Такая солнечная карта, а самого солнца не видно. Странно...",
        "Как вам, кстати, новые курочки и петушки?",
        "А покажете прострел банана с Т-апсов?",
    ],
    "<:Mirage:836730674480283708>": [
        "Я думаю, никто не против!",
        "И правда, почему бы не Мираж?",
        "Наслаждайтесь, пока её не отправили на ремастер.",
        "Хороший выбор.",
        "Вы же помните смоки на А..?",
        "Удачи там!",
        "Классика.",
        "Компромиссный вариант!",
        "Должно быть несложно.",
        "_Музыка на-а-ас связала..._",
    ],
    "<:Nuke:836731638787473418>": [
        "Один на радио, один у ящика, один — сквики. Вы знаете.",
        "Как там со смоками на улицу обстоит вопрос?",
        "*«Я ядерный, я дикий...»*",
        "Играйте командно!",
        "Посадите на нож кого-нибудь в вентах!",
        "Заберите эту карту!",
        "«Это А! Ой, нет, Б!»",
        "Только определитесь, кто смотрит улицу.",
        "FranzJ presents.",
        "Самая скучная с точки зрения раскидки карта!",
    ],
    "<:Vertigo:836732851307282462>": [
        "Какой... *Головокружительный* выбор.",
        "Незаслуженно обделённая вниманием карта, как по мне..",
        "Не забывайте покупать щипцы.",
        "Смотрите под ноги.",
        ":cityscape: :construction_site: :man_construction_worker_tone1:",
        "Неужели.",
        "Необычный выбор.",
        "Не падайте там!",
        "Как насчёт ранбуста с Т-спауна?",
    ],
    "<:Overpass:836730674387353630>": [
        "Мудрый выбор.",
        "Как прогулка в парке.",
        "«Хаешки на мид» или как вы там говорите..",
        "На одной линии ресторан, туалет и канализация. Глубоко...",
        "Помните катку с финном, «играйте по инфе». И всё будет хорошо!",
        "Не скупитесь на молотов в рампу!",
        "Аккуратнее там в коннекторе!",
        "Viel Glück!",
        "Сигнатурная, всё-таки.",
        "Превентивный моллик в «монстра» ещё никому не повредил!",
    ],
    "<:Office:836730674416844800>": [
        "Рофлокатка, да?",
        ":roll_of_paper::fog: :man_running_tone1:",
        "Какое Инферно? По Офису и спать!",
        "А как играть..?",
        "Признавайтесь, чей выбор?!",
        "Правильно, не всё время же на нормальных картах играть.",
        "Не заденьте заложников! Это дорого...",
        "Отдохнёте хоть.",
        "Главное, не пушьте за защиту!",
        "Надеюсь, обойдётся без крутилок.",
        "Иные умудряются Бигстаром стать на Офисе, так что держу кулачки!",
        "Никита номер два плохо на вас влияет...",
        "Просто стреляйте на удачу в дым — но не подставляйтесь!",
    ],
    "<:Train:836730674701402133>": [
        "Старайтесь давать инфу!",
        "Как Нави в лучшие годы!",
        "В любой непонятной ситуации пушьте зелень!",
        " :bullettrain_front:  :bullettrain_front:  :bullettrain_front:",
        "Вы сможете!",
        "Чу-чух-чу-чух.",
        "Наконец-то пригодятся АУГи.",
        "На Б можете оставить одного.",
        "Соскучились по Трейну, да?",
        "Хорошая карта. Жаль, убрали из соревновательных!",
        "Мечта снайпера.",
    ],
    "<:Cache:836730674764447797>": [
        "Держу за вас кулачки.",
        "...а кто на мид?",
        "Опять в Припять...",
        "Надеюсь, вы не пожалеете об этом выборе!",
        "Больше не путайте «машину» и «кар», хорошо?",
        "Зря её убрали из соревновательного пула...",
        "Ну что, 4-16?",
        "Как захотели!",
        "...а покажете прострел с Т-спауна?",
        "Я в вас верю.",
        "Почему-то эту карту особенно любят ценители Доты...",
    ],
    "<:Ancient:839188694631055390>": [
        "Захотелось экзотики, да?",
        "А как раскидывать?",
        "Аккуратнее там, от малярии никто не застрахован.",
        "Вы же знаете, что она никогда не заменит вам Тускан.",
        "Правильно, к официальным турнирам готовиться надо.",
        "Надеюсь, не попадётесь на завсегдатаев Эншента!",
        "Необычное пожелание.",
        "Мой любимый диафильм.",
        "Вы там жаловались, что Кэш слишком зелёный..?",
        "Мокро.",
        "А что с кадрами..?",
        "Спасибо Петрику за «Лару»!",
    ],
    "<:Anubis:1043425411750703155>": [
        "Даст типа такой: «да-да, пошёл я нахер...».",
        "Растягиваем маппул двумя руками!",
        "Так, кто проголосовал?",
        "...когда Эншент уже не вставляет.",
        "И никаких Ану... А, проехали.",
        "Очередная песочно-жёлтая карта, ура!",
        "Кайфуха... Нереальная.",
        "Что, всё ещё лучше Офиса?",
        "На воду не смотреть, берегите свои FPS!"
    ],
    "AnecdoteList": [
        "Ну такое..",
        "О, этот я не слышала.",
        "Извините.",
        "Видела такой же, но про хохла.",
        "Так не смешно же!",
        "Ой, этот дурацкий какой-то...",
        "О, неплохой.",
        "Это уже категория «В».",
        "Жуть.",
        "Дичь.",
        "Как страшно жить...",
        "Платина!",
        "*засмеялась неприятно*",
        "Как вам?",
        "Что не смеётесь? Не смешно? Не поняли? ЭТО РОССИЯ!",
        "Других анеков у меня для вас нет..",
        "Это, если что, категория «Б».",
        "По-своему забавный, да.",
        "Не худший в своей категории!",
        ":rofl:",
        ":moyai: :moyai: :moyai:",
        "Согласны?",
        "Узнали?",
        "Ооо-кей...",
        "И вот вам такое нравится?",
        "Не моё.",
        ":rolling_eyes:",
        "Это переделка какая-то, что ли?",
        "Как мило.",
        "Мне аж поплохело..",
        "Уф.",
        "Кринж.",
        "Не поняла...",
        "Ой...",
        "Ой-ой.",
        "О-оу.",
        "Oof.",
        "Хех.",
        "Пошлятина какая-то!",
        "Задние ряды!",
        "Господи, зачем я это зачитала...",
        "Я этот не выбирала, случайно выпал!",
        "А можно не надо больше?",
        "Кххх.",
    ],
    "2000_anek": [
        "Ой, Дискорд не даст мне зачитать такой длинный. Ну и ладно.",
        "Ну кто пишет такие длинные анекдоты?",
        "Это что, левый мем какой-то?",
        "Какой-то он длинный...",
        "В нём что, больше двух тысяч символов..?",
    ],
    "long_anek_link": [
        "Если нужно — вот: ",
        "Для чтецов: ",
        "Вам нужно — вы и читайте! ",
        "Если что, я про этот: ",
        "Вы посмотрите на этот ужас: ",
    ],
    "dont_bet_yo_ass": [
        "А может, не надо прям ставить?",
        "А вдруг проиграешь?",
        "Ставки выросли!",
        "Так и проиграть можно...",
        "Что, прямо ставишь?",
        "Ва-банк!",
        "Опасные игры...",
    ],
    "CS": {
        397156462637482017: [
            "Наконец-то фокусы с... А впрочем, проехали.",
            "С Андреем должно быть попроще.",
            "«Килька в томате», значит.",
            "Андрей, покажи там всем свой красный кварц!",
            "*Ахаха, шыыышка...*",
            "Андрей, а может, ну этот галиль..?",
        ],  # shishka
        168327786900094978: [
            "Надеюсь, Антон в хорошем настроении.",
            "Не стесняйтесь дёргать Антона на предмет тактических инициатив, хе-хе.",
            "Антон, от вас лично жду больше «тридцаточки».",
            "Антон, гори, но не сгорай!",
            "Надеюсь, Антон сегодня не такой печальный...",
            "Остальным привет, Антону соболезную!",
            "Надеюсь, после этой катки у Антона не обострится депрессия.",
            "Бывших киберспортсменов не бывает, помни, Антон!",
        ],  # costa
        533595594862624778: [
            "Получается, Валерий всё-таки не удалил игру?",
            "Валерий, вы же помните, что это всего лишь игра?",
            "Валерий, только пожалуйста, не реагируйте слишком бурно.",
            "Валерий, разрешаю отдать голос кому-то из игроков, если не знаете, что выбрать.",
            "И нет, Валерий, Эйдженси нельзя выбрать.",
        ],  # valery
        139070694641238016: [
            "Не забудьте размутить Василия.",
            "Надеюсь, игра пройдёт без шума электронных сигарет.",
            "Ожидаю хедшотов с дигла от Василия!",
            "Надеюсь, уровень токсичности не превысит... Обыденные значения.",
        ],  # bakabons
        447115912072658961: [
            "Илюша, желаю тебе побольше кадров.",
            "Илюша, не сделаешь ты раскид — не сделает никто.",
            "Илья, я настаиваю на твоей снайперской роли — настаивай и ты.",
            "Илюш, ты же трезв?",
            "Только не подтолкните этой каткой Илью к ещё большему алкоголизму...",
            "Наслаждайтесь, пока Илья вновь не удалил игру!",
        ],  # ilya
        310875042579873802: [
            "Не обижайте Алину.",
            "Необычно видеть девушку в команде.",
        ],  # alivka
        387848969788588032: [
            "Мне бы такое желание жить, какое у Андрея СД к игре..",
            "Правильно, не всё ж в Ворлд оф Варкрафт играть.",
            "А фронтендеры, смотрю, востребованы даже в контрстрайке...",
            "Сначала показалось, что с вами Кирюша Бледный...",
            "Надеюсь, СД всё-таки прикроет спину.",
            "Желаю поменьше токсичности с составе...",
        ],  # sd
        # 476100337355456552:[
        # "test1",
        # "test2",
        # "test3",], #mark
        377069252638670848: [
            "Вы же не проиграете с киберспортсменом в команде, да?",
            "Булату привет, остальным соболезную!",
            "Десятый фейсит в здании.",
        ],  # boolat
        691672630696214608: [
            "...а кто позвал этого грубияна?",
            "Всегда интересовало, а как вы обращаетесь к Никите номер два?",
            "Аккуратнее с этим... офисным работником.",
            "Не знаю, как вы терпите постоянную отрыжку этого огра...",
            "Надеюсь, эта «Абдулла» хоть на сей раз отыграет...",
            "Этого бармена в Челябинске видела!",
        ],  # dora
        341493781411135488: [
            "Савелий, готовьтесь морально к нормальной карте...",
        ],  # nozarashi Савелий-Сава
        307789015849893888: [
            "Никита, прошу, играй с командой.",
            "Не злитесь на Никиту, он такой, какой есть.",
            "И нет, Никита, против вас, скорее всего, не читеры.",
            "Никита, не чуди. Пожалуйста.",
            "Никита, давай без фишечных раскидок, хорошо?",
            "...но давайте без «дефузов в имени», договорились?",
            "Лет зе ганс блем, как говорится!",
            "Ну что, Никита, вии-чии?",
        ],  # hans
        419236222347771904: [
            "Отдельно желаю удачи Виктору — играет с нами не так часто, как хотелось бы.",
            "¡Víctor, trae la victoria!",
        ],  # barandiaran
        384047909320261633: [
            "Не знаю, как вы уговорили Продавана, но... Удачи вам!",
        ],  # prodavan
        197163728867688448: [
            "Луковый мальчик, прямо как в Гантц..!",
            "Правильно, не всё же с клиентами чатиться.",
            "Виктор, подключите уже чат-бота к этим вашим текстовым, и играйте всласть!",
            "...а чуркам — молчать!",
            "...а сможет ли Виктор?",
        ],  #onionlad
        281809533813129217: [
            "Лемы в чате!",
            "Очередная порция сладкого дыхания Семёна, завидую!",
        ],  #semen
    },
    "too_many_capsules": [
        "Куда тебе столько капсул? Вот тебе одну.",
        "Чего такое лицо недовольное? Сказано же, остальные капсулы ближе к выходным будут.",
        "Ой, много капсул. Давай я тебе одну открою, но с повышенным шансом на золотую!",
        "Не нужно жадничать. Вот тебе одна капсула.",
        "Я больше семи не открою. А сейчас, в качестве назидания, открою лишь одну.",
        "Так много капсул! Я сберегу твои деньги и открою лишь одну.",
    ],
    "NoCaseNameList": [
        "Уточни, пожалуйста, какой кейс открыть.",
        "Мне нужно название кейса.",
        "Хорошо, какой открываем?",
        "А какой кейс?",
        "Что открываем?",
        "В следующий раз сразу укажи название.",
        "Синьки из какого кейса возжелалось?",
        "Конечно, вот список:",
        "...а какой?",
        "Вот список, выбирай.",
        "Любой из доступных.",
        "Вот (пока неполный) список.",
    ],
    # "CaseReminder": [ # был в подвале эмбеда списка кейсов, временно неактуально
    #     "Помните: лудомания разрушает семьи и жизни.",
    #     "Открытие кейсов — потеря денег.",
    #     "House always wins.",
    #     "Габен вам будет благодарен.",
    #     "Do you feel lucky, punk?",
    #     "Надеюсь, повезёт.",
    #     "Мой дедушка так дачу в преферанс проиграл...",
    #     "Опять крутим?",
    #     "Лучше тут, чем где-то в подворотне...",
    # ],
    "caserollinList": [
        "Дождись прокрутки прошлого кейса, пожалуйста.",
        "Один кейс за раз!",
        "Наберись терпения, прошу.",
        "Кейсы крутятся в строгом порядке!",
        "Не могу, кручу предыдущий.",
        "...так уже крутится же!",
        "Кто-то где-то что-то уже крутит.",
        "Докручу и покручу!",
    ],
    "GlovesReactionList": [
        "Перчаточки!",
        "Теперь ручки не будут мёрзнуть!",
        "Это даже лучше, чем нож!",
        "Подожди, перчатки?!",
        "Варежки!",
        "Рукавички!",
    ],
    "GambleReactions": {
        "Bad": [
            "«Повезлоу, повезлоу-у...»",
            "Не лучшее вложение 192 рублей — или сколько они там уже...",
            "Новый день, новый шлак.",
            "Расплескалась синева...",
            "Ещё чуть-чуть, ещё один кейсик!",
            "В следующем точно нож!",
            "Попробуй ещё!",
            "Вас ещё не тошнит от синего цвета?",
            "Ну а чего ты ожидал?",
            "Боже, это плохо.",
            "Зато реалистично!",
            "Не повезло, не повезло...",
            "Сегодня не твой день, смотрю, да?",
            "Рот этого казино!",
            "Колоды в киосках заряжают!",
            "Это уже лудомания или ещё нет?",
            "Хорошо, что я не открываю кейсы...",
            "Учитесь на чужих ошибках!",
            ":sob: :sob: :sob:",
            "Напоминает отца...",
            "Рад, что сэкономил деньги?",
            "Вот почему не стоит открывать кейсы!",
            "Извините, весь лут забрал Францджей!",
            "Почему так плохо?",
            "Несчастье-то какое...",
            "Кейсы — игрушка дьявола, ежжи.",
            "Ой.",
            "stonks",
            "Вот почему не надо открывать кейсы.",
            "Ой!",
            "Хе-хе-хе.",
            "Ну, бывает.",
            "Твою ж...",
            "ОТКРЫТИЕ КЕЙСОВ",
            "Нажми сюда, чтобы посмотреть эту дешёвку на торговой площадке.",
            "Ничего, повезёт с настоящим!",
            "Нет, ну это просто издевательство.",
            "О боже...",
            "Хех, просто хех.",
            "Ой, неприятно вышло.",
            "Не такая уж была и хорошая идея, да?",
            "Какой позор.",
            ":eyes:",
            "Всё вздор, давай по-новой.",
            "«Настоящий джентльмен, если бы проиграл и все свое состояние, не должен волноваться. Деньги до того должны быть ниже джентльменства, что почти не стоит об них заботиться»",
        ],
        "Ok": [
            "Ну, хотя бы окупился. Или нет..?",
            "Не худшее, что могло выпасть!",
            "Нормально!",
            "О, пошёл процесс!",
            "Гм... Сойдёт?",
            "Зато мало-мальски редкое, да?",
            "Ну а вы чего хотели?",
            "ОК.",
            "Почти не позор!",
            "На безрыбье и рак...",
        ],
        "Good": [
            "Круто, поздравляю!",
            "Молодец!",
            "А вот это уже другое дело!",
            "Повезло!",
            "Фух...",
            "Неплохо, неплохо.",
            "Достойно!",
            "Неплохо, неплохо.",
            "Не зря открывал кейсы! Этот точно не зря...",
            "Козырно!",
        ],
        "Best": [
            ":scream: :scream: :scream:",
            "Некоторым и за сотню кейсов такое не выпадает!",
            "Не нож, но тоже неплохо!",
            "О, счастливчик!",
            "Жесть.",
            "Эх, вот бы в игре так...",
        ],
        "Crazy": [
            "AAAAAAAAAAAAAA",
            "БОЛЬШЕ НИКОГДА НЕ ОТКРЫВАЙ КЕЙСЫ.",
            "Это. Не. Можыд. Быт.",
            "Так везёт лишь раз в жизни...",
            ":smoking:",
            ":gem:",
        ],
    },
    "ExceptionalCases": [
        [[["Horizon Case", "Danger Zone Case"], "HorizonKnives"], [["Operation Riptide Case", "Dreams & Nightmares Case"], "RiptideKnives"], [["Gamma Case", "Gamma 2 Case"], "GammaKnives"], [["Spectrum Case", "Spectrum 2 Case"], "SpectrumKnives"], [["Chroma 3 Case", "Chroma 2 Case", "Chroma Case"], "ChromaKnives"], [["Prisma Case", "Prisma 2 Case"], "PrismaKnives"], [["Shattered Web Case", "Fracture Case"], "ShatterKnives"]],
        [[["Snakebite Case", "Operation Broken Fang Case", "Recoil Case"], "BrokenFang"], [["Operation Hydra Case", "Glove Case"], "Hydra"], ["Clutch Case", "Clutch Case"]]
    ],
    # "CasesforEmbed": [
    #     [
    #         ":butterfly: *Оружейный кейс операции «Прорыв»*",
    #         "он же _«брейкаут»_ или _«Breakout»_",
    #     ],
    #     [":tooth: *Кейс операции «Сломанный клык»*", "он же _«брокенфанг»_"],
    #     [":snake: *Snakebite Case*", "он же _«снейкбайт»_"],
    #     [":knife: *CS20 Case*", "он же _«CS20»_ или _«кс20»_"],
    #     [":detective_tone1: *Тёмный кейс*", "он же _«Shadow»_ или _«шедоу»_"],
    #     [":small_red_triangle: *Кейс «Призма»*", "он же  _«Prisma»_"],
    #     [":small_red_triangle_down: *Кейс «Призма 2»*", "он же _«Prisma 2»_"],
    #     [":gloves: *Перчаточный кейс*", "он же _«глов»_"],
    #     [":spider: *Кейс «Расколотая сеть»*", "он же _«шаттер»_"],
    #     [":fire: *Кейс операции «Дикое пламя»*", "он же _«боуи»_"],
    #     [":skull: *Кейс «Фальшион»*", "он же _«бладхаунд»_"],
    #     [":eagle: *Кейс «Решающий момент»*", "он же _«клатч»_"],
    #     [":gun: *Оружейный кейс*", "он же _«вепан1»_"],
    #     [":spider_web: *Кейс «Разлом»*", "он же _«фракчур»_"],
    #     [":bow_and_arrow: *Охотничий оружейный кейс*", "он же _«хантсман»_"],
    #     [":star2: *Хромированный оружейный кейс*", "он же _«хрома»_"],
    #     [":stars: *Хромированный кейс #2*", "он же _«хрома 2»_"],
    #     [":star: *Хромированный кейс #3*", "он же _«хрома 3»_"],
    #     [":sunrise_over_mountains: *Кейс «Горизонт»*", "он же _«хорайзон»_"],
    #     [":anger: *Кейс «Запретная зона»*", "он же _«дэнжерзон»_"],
    #     [":dagger: *Кейс «Спектр»*", "он же _«спектр»_"],
    #     [":crossed_swords: *Кейс «Спектр 2»*", "он же _«спектр 2»_"],        
    #     [":sparkler: *Гамма-кейс*", "он же _«гамма»_"],
    #     [":fireworks: *Гамма-кейс #2*", "он же _«гамма 2»_"],
    #     [":money_with_wings: *Оружейный кейс операции «Авангард»*", "он же _«вангард»_"],
    #     [":snowflake: *Оружейный кейс «Winter Offensive»*", "он же _«зимний»_"],
    #     [":dragon_face: *Кейс операции «Гидра»*", "он же _«hydra»_"],
    #     #[":grey_question: *Следующий кейс*", "ждём выхода нового кейса!"],
    # ],
    "Gloves": {
        "Clutch Case": [
            "Driver Gloves | King Snake",
            "Driver Gloves | Imperial Plaid",
            "Driver Gloves | Overtake",
            "Driver Gloves | Racing Green",
            "Hand Wraps | Cobalt Skulls",
            "Hand Wraps | Overprint",
            "Hand Wraps | Arboreal",
            "Hand Wraps | Duct Tape",
            "Hydra Gloves | Emerald",
            "Hydra Gloves | Rattler",
            "Hydra Gloves | Mangrove",
            "Hydra Gloves | Case Hardened",
            "Moto Gloves | POW!",
            "Moto Gloves | Polygon",
            "Moto Gloves | Turtle",
            "Moto Gloves | Transport",
            "Specialist Gloves | Fade",
            "Specialist Gloves | Crimson Web",
            "Specialist Gloves | Mogul",
            "Specialist Gloves | Buckshot",
            "Sport Gloves | Vice",
            "Sport Gloves | Amphibious",
            "Sport Gloves | Omega",
            "Sport Gloves | Bronze Morph",
        ],
        "Hydra": [
            "Bloodhound Gloves | Snakebite",
            "Bloodhound Gloves | Charred",
            "Bloodhound Gloves | Bronzed",
            "Bloodhound Gloves | Guerrilla",
            "Driver Gloves | Crimson Weave",
            "Driver Gloves | Convoy",
            "Driver Gloves | Lunar Weave",
            "Driver Gloves | Diamondback",
            "Hand Wraps | Slaughter",
            "Hand Wraps | Badlands",
            "Hand Wraps | Leather",
            "Hand Wraps | Spruce DDPAT",
            "Moto Gloves | Spearmint",
            "Moto Gloves | Cool Mint",
            "Moto Gloves | Boom!",
            "Moto Gloves | Eclipse",
            "Specialist Gloves | Crimson Kimono",
            "Specialist Gloves | Emerald Web",
            "Specialist Gloves | Foundation",
            "Specialist Gloves | Forest DDPAT",
            "Sport Gloves | Pandora's Box",
            "Sport Gloves | Superconductor",
            "Sport Gloves | Hedge Maze",
            "Sport Gloves | Arid",
        ],
        "BrokenFang": [
            "Broken Fang Gloves | Needle Point",
            "Broken Fang Gloves | Jade",
            "Broken Fang Gloves | Yellow-banded",
            "Broken Fang Gloves | Unhinged",
            "Driver Gloves | Snow Leopard",
            "Driver Gloves | Black Tie",
            "Driver Gloves | Rezan the Red",
            "Driver Gloves | Queen Jaguar",
            "Hand Wraps | CAUTION!",
            "Hand Wraps | Constrictor",
            "Hand Wraps | Giraffe",
            "Hand Wraps | Desert Shamagh",
            "Moto Gloves | Blood Pressure",
            "Moto Gloves | Smoke Out",
            "Moto Gloves | Finish Line",
            "Moto Gloves | 3rd Commando Company",
            "Specialist Gloves | Tiger Strike",
            "Specialist Gloves | Lt. Commander",
            "Specialist Gloves | Marble Fade",
            "Specialist Gloves | Field Agent",
            "Sport Gloves | Slingshot",
            "Sport Gloves | Nocts",
            "Sport Gloves | Scarlet Shamagh",
            "Sport Gloves | Big Game",
        ],
    },
    "Knives": {
        "Bayonet | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Bayonet": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Bayonet | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Bayonet | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Bayonet | Night": {
            "floatrange": [0.06, 0.8],
            "text": "It's the whisper of the wind... it's the bite at your neck",
        },
        "Bayonet | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Bayonet | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Bayonet | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Bayonet | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Bayonet | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Bayonet | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Bayonet | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Bayonet | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Flip Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Flip Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Flip Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Flip Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Flip Knife | Night": {
            "floatrange": [0.06, 0.8],
            "text": "It's the whisper of the wind... it's the bite at your neck",
        },
        "Flip Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Flip Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Flip Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Flip Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Flip Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Flip Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Flip Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Flip Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Gut Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Gut Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Gut Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Gut Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Gut Knife | Night": {
            "floatrange": [0.06, 0.8],
            "text": "It's the whisper of the wind... it's the bite at your neck",
        },
        "Gut Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Gut Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Gut Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Gut Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Gut Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Gut Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Gut Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Gut Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Karambit | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Karambit": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Karambit | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Karambit | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Karambit | Night": {
            "floatrange": [0.06, 0.8],
            "text": "It's the whisper of the wind... it's the bite at your neck",
        },
        "Karambit | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Karambit | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Karambit | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Karambit | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Karambit | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Karambit | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Karambit | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Karambit | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "M9 Bayonet | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "M9 Bayonet": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "M9 Bayonet | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "M9 Bayonet | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "M9 Bayonet | Night": {
            "floatrange": [0.06, 0.8],
            "text": "It's the whisper of the wind... it's the bite at your neck",
        },
        "M9 Bayonet | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "M9 Bayonet | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "M9 Bayonet | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "M9 Bayonet | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "M9 Bayonet | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "M9 Bayonet | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "M9 Bayonet | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "M9 Bayonet | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
    },
    "GammaKnives": {
        "Bayonet | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Bayonet | Lore": {
            "floatrange": [0, 0.65],
            "text": "It has been custom painted with knotwork.",
        },
        "Bayonet | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Bayonet | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "Bayonet | Freehand": {
            "floatrange": [0, 0.48],
            "text": "It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Bayonet | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "Flip Knife | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Flip Knife | Lore": {
            "floatrange": [0, 0.65],
            "text": "It has been custom painted with knotwork.",
        },
        "Flip Knife | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Flip Knife | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "Flip Knife | Freehand": {
            "floatrange": [0, 0.48],
            "text": "It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Flip Knife | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "Gut Knife | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Gut Knife | Lore": {
            "floatrange": [0, 0.65],
            "text": "It has been custom painted with knotwork.",
        },
        "Gut Knife | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Gut Knife | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "Gut Knife | Freehand": {
            "floatrange": [0, 0.48],
            "text": "It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Gut Knife | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "Karambit | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Karambit | Lore": {
            "floatrange": [0, 0.65],
            "text": "It has been custom painted with knotwork.",
        },
        "Karambit | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Karambit | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "Karambit | Freehand": {
            "floatrange": [0, 0.48],
            "text": "It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Karambit | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "M9 Bayonet | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "M9 Bayonet | Lore": {
            "floatrange": [0, 0.65],
            "text": "It has been custom painted with knotwork.",
        },
        "M9 Bayonet | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "M9 Bayonet | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "M9 Bayonet | Freehand": {
            "floatrange": [0, 0.48],
            "text": "It has been painted black and purple, then decorated with a metallic marker.",
        },
        "M9 Bayonet | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
    },
    "SpectrumKnives": {
        "Bowie Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal"
        },
        "Bowie Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Bowie Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        }, 
        "Bowie Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },   
        "Bowie Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },   
        "Bowie Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "Butterfly Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal"
        },
        "Butterfly Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Butterfly Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        }, 
        "Butterfly Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },   
        "Butterfly Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },   
        "Butterfly Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        }, 
        "Falchion Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal"
        },
        "Falchion Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Falchion Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        }, 
        "Falchion Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },   
        "Falchion Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },   
        "Falchion Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        }, 
        "Huntsman Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal"
        },
        "Huntsman Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Huntsman Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        }, 
        "Huntsman Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },   
        "Huntsman Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },   
        "Huntsman Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        }, 
        "Shadow Daggers | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal"
        },
        "Shadow Daggers | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Shadow Daggers | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        }, 
        "Shadow Daggers | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },   
        "Shadow Daggers | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },   
        "Shadow Daggers | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },   
    },
    "HorizonKnives": {
        "Navaja Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Navaja Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Navaja Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Navaja Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Navaja Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Navaja Knife | Night Stripe": {
            "floatrange": [0.06, 0.8],
            "text": "Spray... Pray... Paint... Stab.",
        },
        "Navaja Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Navaja Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Navaja Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Navaja Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Navaja Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Navaja Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Navaja Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Stiletto Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Stiletto Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Stiletto Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Stiletto Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Stiletto Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Stiletto Knife | Night Stripe": {
            "floatrange": [0.06, 0.8],
            "text": "Spray... Pray... Paint... Stab.",
        },
        "Stiletto Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Stiletto Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Stiletto Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Stiletto Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Stiletto Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Stiletto Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Stiletto Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Talon Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Talon Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Talon Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Talon Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Talon Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Talon Knife | Night Stripe": {
            "floatrange": [0.06, 0.8],
            "text": "Spray... Pray... Paint... Stab.",
        },
        "Talon Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Talon Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Talon Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Talon Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Talon Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Talon Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Talon Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Ursus Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Ursus Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Ursus Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Ursus Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Ursus Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Ursus Knife | Night Stripe": {
            "floatrange": [0.06, 0.8],
            "text": "Spray... Pray... Paint... Stab.",
        },
        "Ursus Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Ursus Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Ursus Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Ursus Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Ursus Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Ursus Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Ursus Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
    },
    "RiptideKnives": {
        "Bowie Knife | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Bowie Knife | Lore": {
            "floatrange": [0, 1],
            "text": "It has been custom painted with knotwork.",
        },
        "Bowie Knife | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Bowie Knife | Freehand": {
            "floatrange": [0, 0.48],
            "text": " It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Bowie Knife | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "Bowie Knife | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "Butterfly Knife | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Butterfly Knife | Lore": {
            "floatrange": [0, 1],
            "text": "It has been custom painted with knotwork.",
        },
        "Butterfly Knife | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Butterfly Knife | Freehand": {
            "floatrange": [0, 0.48],
            "text": " It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Butterfly Knife | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "Butterfly Knife | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "Falchion Knife | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Falchion Knife | Lore": {
            "floatrange": [0, 1],
            "text": "It has been custom painted with knotwork.",
        },
        "Falchion Knife | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Falchion Knife | Freehand": {
            "floatrange": [0, 0.48],
            "text": " It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Falchion Knife | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "Falchion Knife | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "Huntsman Knife | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Huntsman Knife | Lore": {
            "floatrange": [0, 1],
            "text": "It has been custom painted with knotwork.",
        },
        "Huntsman Knife | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Huntsman Knife | Freehand": {
            "floatrange": [0, 0.48],
            "text": " It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Huntsman Knife | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "Huntsman Knife | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
        "Shadow Daggers | Gamma Doppler": {
            "floatrange": [0, 0.08],
            "text": "It has been painted with black and silver metallic paints using a marbleizing medium, then candy coated.",
        },
        "Shadow Daggers | Lore": {
            "floatrange": [0, 1],
            "text": "It has been custom painted with knotwork.",
        },
        "Shadow Daggers | Autotronic": {
            "floatrange": [0, 0.85],
            "text": "It has been anodized red and uses steel mesh to lighten the weight.",
        },
        "Shadow Daggers | Freehand": {
            "floatrange": [0, 0.48],
            "text": " It has been painted black and purple, then decorated with a metallic marker.",
        },
        "Shadow Daggers | Bright Water": {
            "floatrange": [0, 0.5],
            "text": "It has been painted using a blue camo hydrographic.",
        },
        "Shadow Daggers | Black Laminate": {
            "floatrange": [0, 1],
            "text": "It has been stonewashed and given a black laminate handle.",
        },
    },
    "ShatterKnives": {
        "Nomad Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Nomad Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Nomad Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Nomad Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Nomad Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Nomad Knife | Night Stripe": {
            "floatrange": [0.06, 0.8],
            "text": "Spray... Pray... Paint... Stab.",
        },
        "Nomad Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Nomad Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Nomad Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Nomad Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Nomad Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Nomad Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Nomad Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Paracord Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Paracord Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Paracord Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Paracord Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Paracord Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Paracord Knife | Night Stripe": {
            "floatrange": [0.06, 0.8],
            "text": "Spray... Pray... Paint... Stab.",
        },
        "Paracord Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Paracord Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Paracord Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Paracord Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Paracord Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Paracord Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Paracord Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Skeleton Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Skeleton Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Skeleton Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Skeleton Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Skeleton Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Skeleton Knife | Night Stripe": {
            "floatrange": [0.06, 0.8],
            "text": "Spray... Pray... Paint... Stab.",
        },
        "Skeleton Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Skeleton Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Skeleton Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Skeleton Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Skeleton Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Skeleton Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Skeleton Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
        "Survival Knife | Slaughter": {
            "floatrange": [0.01, 0.26],
            "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
        },
        "Survival Knife": {
            "floatrange": [0, 1],
            "text": "Vanilla",
        },
        "Survival Knife | Blue Steel": {
            "floatrange": [0, 1],
            "text": "This is the malbec of weapon design - Booth, Arms Dealer",
        },
        "Survival Knife | Crimson Web": {
            "floatrange": [0.06, 0.8],
            "text": "Be careful where you walk, you never know where the web is spread",
        },
        "Survival Knife | Case Hardened": {
            "floatrange": [0, 1],
            "text": "A little color never hurt anyone",
        },
        "Survival Knife | Night Stripe": {
            "floatrange": [0.06, 0.8],
            "text": "Spray... Pray... Paint... Stab.",
        },
        "Survival Knife | Stained": {
            "floatrange": [0, 1],
            "text": "If you think it's messy now, wait until you see it under a blacklight",
        },
        "Survival Knife | Forest DDPAT": {
            "floatrange": [0.06, 0.8],
            "text": "By the time you're close enough to notice the pixels it's already too late",
        },
        "Survival Knife | Boreal Forest": {
            "floatrange": [0.06, 0.8],
            "text": "The woods can be a dangerous place... never travel alone",
        },
        "Survival Knife | Safari Mesh": {
            "floatrange": [0.06, 0.8],
            "text": "A predator is a predator, no matter the environment",
        },
        "Survival Knife | Urban Masked": {
            "floatrange": [0.06, 0.8],
            "text": "True power is demonstrated with subtle application",
        },
        "Survival Knife | Scorched": {
            "floatrange": [0.06, 0.8],
            "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
        },
        "Survival Knife | Fade": {
            "floatrange": [0, 0.08],
            "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
        },
    },
    "ChromaKnives": {
        "Bayonet | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Bayonet | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "Bayonet | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "Bayonet | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "Bayonet | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "Bayonet | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
        "Flip Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Flip Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "Flip Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "Flip Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "Flip Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "Flip Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
        "Gut Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Gut Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "Gut Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "Gut Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "Gut Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "Gut Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
        "Karambit | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Karambit | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "Karambit | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "Karambit | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "Karambit | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "Karambit | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
        "M9 Bayonet | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "M9 Bayonet | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "M9 Bayonet | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "M9 Bayonet | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "M9 Bayonet | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "M9 Bayonet | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
    },
    "PrismaKnives": {
        "Navaja Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "Navaja Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "Navaja Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Navaja Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
        "Navaja Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "Navaja Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "Stiletto Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "Stiletto Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "Stiletto Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Stiletto Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
        "Stiletto Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "Stiletto Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "Talon Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "Talon Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "Talon Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Talon Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
        "Talon Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "Talon Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
        "Ursus Knife | Doppler": {
            "floatrange": [0, 0.08],
            "text": "Getting lost in its color can prove fatal",
        },
        "Ursus Knife | Tiger Tooth": {
            "floatrange": [0, 0.08],
            "text": "Like the tiger it is rare... like the tiger it is deadly...",
        },
        "Ursus Knife | Marble Fade": {
            "floatrange": [0, 0.08],
            "text": "The blade is made of many colors, but soon it all looks red",
        },
        "Ursus Knife | Ultraviolet": {
            "floatrange": [0.06, 0.8],
            "text": "Elegant design paired with brutal intent",
        },
        "Ursus Knife | Damascus Steel": {
            "floatrange": [0, 0.5],
            "text": "Finally, a weapon strong enough to match your resolve",
        },
        "Ursus Knife | Rust Coat": {
            "floatrange": [0.4, 1],
            "text": "Some people don't need to hide how dirty their deeds are",
        },
    },
    "Operation collections": {
        "The 2021 Mirage Collection": {
            "Aliases": ["мираж", "mirage"],
            "Consumer": {
                "P250 | Drought": {
                    "floatrange": [0, 0.44],
                    "text": "All that remains"
                },                
                "MAG-7 | Navy Sheen": {
                    "floatrange": [0, 0.55],
                    "text": "Why so blue?"
                },                
                "SSG 08 | Prey": {
                    "floatrange": [0, 0.48],
                    "text": "Eat, sleep, hunt, repeat"   
                },             
                "MAC-10 | Sienna Damask": {
                    "floatrange": [0, 0.6],
                    "text": "Technically the best camouflages are the ones you don't notice..."
                },                
                "PP-Bizon | Anolis": {
                    "floatrange": [0, 0.5],
                    "text": "Painted to scale"
                },
            },
            "Industrial": {
                "CZ75-Auto | Midnight Palm": {
                    "floatrange": [0, 0.5],
                    "text": "«The sign says closed!»"
                },                
                "FAMAS | CaliCamo": {
                    "floatrange": [0, 0.6],
                    "text": "Rebuilding only comes in the wake of destruction"
                },                
                "P90 | Verdant Growth": {
                    "floatrange": [0, 0.47],
                    "text": "Some see a nuisance; I see beauty"   
                },             
                "Dual Berettas | Drift Wood": {
                    "floatrange": [0, 0.6],
                    "text": "Knock on wood; you're gonna need all the luck you can get - Felix Riley, Commanding Officer"
                },
            },
            "Mil-Spec": {
                "USP-S | Purple DDPAT": {
                    "floatrange": [0, 0.55],
                    "text": "By the time you're close enough to notice the pixels it's already too late"
                },                
                "SG 553 | Desert Blossom": {
                    "floatrange": [0, 0.49],
                    "text": "Nature always wins"
                },                
                "MP9 | Music Box": {
                    "floatrange": [0, 0.55],
                    "text": "Fight of fancy"   
                },             
                "M249 | Humidor": {
                    "floatrange": [0, 0.5],
                    "text": "«What are they keeping in there?»"
                },
            },
            "Restricted": {
                "AUG | Sand Storm": {
                    "floatrange": [0, 0.5],
                    "text": "There is beauty all around us, you just have to know where to look"
                },                
                "Glock-18 | Pink DDPAT": {
                    "floatrange": [0.06, 0.8],
                    "text": "By the time you're close enough to notice the pixels it's already too late"
                },                
                "XM1014 | Elegant Vines": {
                    "floatrange": [0, 0.37],
                    "text": "Some see a nuisance; I see beauty"
                },
            },
            "Classified": {
                "Desert Eagle | Fennec Fox": {
                    "floatrange": [0, 0.8],
                    "text": "All the better to hear you with"
                },                
                "MP5-SD | Oxide Oasis": {
                    "floatrange": [0, 0.55],
                    "text": "A weapon this quiet shouldn't be so loud"
                },
            },
            "Covert": {
                "AWP | Desert Hydra": {
                    "floatrange": [0, 0.6],
                    "text": "Cutting off one head means two more appear—is that a risk you're willing to take? - Valeria Jenner, Revolutionary",
                }
            },
        },
    },
    "Cases": {
        "Recoil Case": {
            "Aliases": ["рекоил", "рекойл", "recoil", "грем"],
            "Mil-Spec": {
                "FAMAS | Meow 36": {
                    "floatrange": [0, 1],
                    "text": "Technically it's four cats, but who's counting?",
                },
                "MAC-10 | Monkeyflage": {
                    "floatrange": [0, 1],
                    "text": "Spunky monkeys!",
                },
                "UMP-45 | Roadblock": {
                    "floatrange": [0, 1],
                    "text": "Seek alternate routes",
                },
                "Glock-18 | Winterized": {
                    "floatrange": [0, 1],
                    "text": "Freeze!",
                },
                "M4A4 | Poly Mag": {
                    "floatrange": [0, 0.1],
                    "text": "Standard operating procedure",
                },
                "Galil AR | Destroyer": {
                    "floatrange": [0, 0.7],
                    "text": "Destroy them all",
                },
                "Negev | Drop Me": {
                    "floatrange": [0, 1],
                    "text": "If the stop sign doesn't convince you the stream of bullets will",
                },
            },
            "Restricted": {
                "SG 553 | Dragon Tech": {
                    "floatrange": [0, 0.7],
                    "text": "That's not my dragon…",
                },
                "M249 | Downtown": {
                    "floatrange": [0, 0.65],
                    "text": "A different kind of spray pattern",
                },
                "R8 Revolver | Crazy 8": {
                    "floatrange": [0, 1],
                    "text": "Inspired by the events of December 8th, 2015",
                },
                "P90 | Vent Rush": {
                    "floatrange": [0, 0.7],
                    "text": "«Do you know how fast you were going?»",
                },                
                "Dual Berettas | Flora Carnivora": {
                    "floatrange": [0, 1],
                    "text": "Help them grow up big and strong",
                },
            },
            "Classified": {
                "P250 | Visions": {
                    "floatrange": [0, 0.7],
                    "text": "One crow short of a murder",
                },
                "Sawed-Off | Kiss♥Love": {
                    "floatrange": [0, 1],
                    "text": "«I won't take no for an answer; I have to have it!»",
                },                
                "AK-47 | Ice Coaled": {
                    "floatrange": [0, 0.77],
                    "text": "Cold to the touch",
                },
            },
            "Covert": {
                "AWP | Chromatic Aberration": {
                    "floatrange": [0, 0.7],
                    "text": "(Not so) easy on the eyes...",
                },                
                "USP-S | Printstream": {
                    "floatrange": [0, 0.85],
                    "text": "WHITE_1; BLACK_1; PEARLESCENT_1; SILENCED_1; PISTOL_1;",
                },
            },     
        },
        "Dreams & Nightmares Case": {
            "Aliases": ["грёз", "грез", "кошмар", "дрим", "найтм", "dreams", "nightmare"],
            "Mil-Spec": {
                "P2000 | Lifted Spirits": {
                    "floatrange": [0, 1],
                    "text": "Many lost souls do not wish to be found",
                },
                "MAG-7 | Foresight": {
                    "floatrange": [0, 0.7],
                    "text": "I've got a good feeling about this...",
                },
                "MP5-SD | Necro Jr.": {
                    "floatrange": [0, 1],
                    "text": "Playtime is over!",
                },
                "MAC-10 | Ensnared": {
                    "floatrange": [0, 0.9],
                    "text": "They have yet to find someone they cannot fool",
                },
                "Five-SeveN | Scrawl": {
                    "floatrange": [0, 0.1],
                    "text": "The first and the last",
                },
                "SCAR-20 | Poultrygeist": {
                    "floatrange": [0, 0.57],
                    "text": "A chicken rides a shark into battle...",
                },
                "Sawed-Off | Spirit Board": {
                    "floatrange": [0, 1],
                    "text": "«Come on, I know you're moving it...»",
                },
            },
            "Restricted": {
                "XM1014 | Zombie Offensive": {
                    "floatrange": [0, 0.5],
                    "text": "«Undead game»",
                },
                "PP-Bizon | Space Cat": {
                    "floatrange": [0, 0.67],
                    "text": "The paws of creation",
                },
                "G3SG1 | Dream Glade": {
                    "floatrange": [0, 1],
                    "text": "«There, a clearing in the forest!»",
                },
                "USP-S | Ticket to Hell": {
                    "floatrange": [0, 0.76],
                    "text": "Designer death",
                },                
                "M4A1-S | Night Terror": {
                    "floatrange": [0, 0.7],
                    "text": "In the bosom of the gentle night, is when I search for the light",
                },
            },
            "Classified": {
                "Dual Berettas | Melondrama": {
                    "floatrange": [0, 1],
                    "text": "Sweet dreams...",
                },
                "FAMAS | Rapid Eye Movement": {
                    "floatrange": [0, 1],
                    "text": "Frantic are the eyes of the dreamer",
                },                
                "MP7 | Abyssal Apparition": {
                    "floatrange": [0, 1],
                    "text": "You cannot escape your destiny",
                },
            },
            "Covert": {
                "MP9 | Starlight Protector": {
                    "floatrange": [0, 0.8],
                    "text": "May the deity protect you, should the deity select you",
                },                
                "AK-47 | Nightwish": {
                    "floatrange": [0, 1],
                    "text": "I've been saving this for a special occasion... – Booth, Arms Dealer",
                },
            },     
        },
        "Operation Riptide Case": {
            "Aliases": ["риптайд", "riptide", "хищные", "воды", "риптиде"],
            "Mil-Spec": {
                "PP-Bizon | Lumen": {
                    "floatrange": [0, 0.77],
                    "text": "Light the way",
                },
                "MP7 | Guerrilla": {
                    "floatrange": [0, 1],
                    "text": "The lion was never king of the jungle",
                },
                "G3SG1 | Keeping Tabs": {
                    "floatrange": [0, 0.7],
                    "text": "You have all the information you need - Franz Kriegeld, Phoenix Tactician",
                },
                "XM1014 | Watchdog": {
                    "floatrange": [0, 1],
                    "text": "Protect and prosper",
                },
                "AUG | Plague": {
                    "floatrange": [0, 0.76],
                    "text": "«Like a moth to a flame»",
                },
                "Dual Berettas | Tread": {
                    "floatrange": [0, 1],
                    "text": "Fine details take the longest, add the most, and are noticed the least",
                },
                "USP-S | Black Lotus": {
                    "floatrange": [0, 0.9],
                    "text": "Adds 3 kills during pistol round, then is discarded",
                },
            },
            "Restricted": {
                "MAG-7 | BI83 Spectrum": {
                    "floatrange": [0, 0.6],
                    "text": "Why are the rarest things the most beautiful?",
                },
                "Five-SeveN | Boost Protocol": {
                    "floatrange": [0, 0.41],
                    "text": "Callsign: MECHA 0272",
                },
                "MP9 | Mount Fuji": {
                    "floatrange": [0, 0.55],
                    "text": "The red sun rises",
                },
                "FAMAS | ZX Spectron": {
                    "floatrange": [0, 1],
                    "text": "Clive would be proud",
                },                
                "M4A4 | Spider Lily": {
                    "floatrange": [0, 1],
                    "text": "Bright colors are a warning, not an invitation",
                },
            },
            "Classified": {
                "SSG 08 | Turbo Peek": {
                    "floatrange": [0, 0.6],
                    "text": "Drifting is a right not a privilege",
                },
                "MAC-10 | Toybox": {
                    "floatrange": [0, 1],
                    "text": "Clean up your mess",
                },                
                "Glock-18 | Snack Attack": {
                    "floatrange": [0, 1],
                    "text": "The snack that fights back",
                },
            },
            "Covert": {
                "AK-47 | Leet Museo": {
                    "floatrange": [0, 0.65],
                    "text": "«Everything you can imagine is real»",
                },                
                "Desert Eagle | Ocean Drive": {
                    "floatrange": [0, 1],
                    "text": "Can't miss—both the colors and when using the weapon",
                },
            },            
        },
        "CS:GO Weapon Case 3": {
            "Aliases": ["оружейный 3", "оружейный кейс 3", "вепан3", "вепан 3"],
            "Mil-Spec": {
                "USP-S | Stainless": {
                    "floatrange": [0, 0.8],
                    "text": "It has a stainless steel slide.",
                },
                "CZ75-Auto | Crimson Web": {
                    "floatrange": [0.06, 0.8],
                    "text": "Be careful where you walk, you never know where the web is spread",
                },
                "Glock-18 | Blue Fissure": {
                    "floatrange": [0.06, 0.58],
                    "text": "It has been painted using a hydrographic in a craquelure pattern.",
                },
                "Dual Berettas | Panther": {
                    "floatrange": [0, 0.58],
                    "text": "It has been painted in a black, grey and red color scheme.",
                },
                "P2000 | Red FragCam": {
                    "floatrange": [0.06, 0.7],
                    "text": "It has been painted using a hydrographic of a polygonal camo.",
                },
            },
            "Restricted": {
                "Desert Eagle | Heirloom": {
                    "floatrange": [0, 0.8],
                    "text": "It has been hand engraved and inlaid with a scroll pattern.",
                },
                "CZ75-Auto | Tread Plate": {
                    "floatrange": [0, 0.2],
                    "text": "It has been covered in a metallic foil with a tread plate pattern.",
                },
                "Five-SeveN | Copper Galaxy": {
                    "floatrange": [0, 0.2],
                    "text": "Stars are just pin pricks at the darkness",
                },
                "Tec-9 | Titanium Bit": {
                    "floatrange": [0, 0.2],
                    "text": "Its barrel shroud has been anodized to a royal blue color and subtly fluted.",
                },
            },
            "Classified": {
                "P250 | Undertow": {
                    "floatrange": [0, 0.2],
                    "text": "It has been painted using metallic paints with a silver slide and a blue and black spotted pattern on the receiver.",
                },
                "CZ75-Auto | The Fuschia Is Now": {
                    "floatrange": [0, 0.4],
                    "text": "It has been painted with a chrome base coat and candied in transparent fuschia and charcoal anodized effect paint.",
                },
            },
            "Covert": {
                "CZ75-Auto | Victoria": {
                    "floatrange": [0, 0.75],
                    "text": "It has been decorated with gold accents and hand-engraved with a scroll pattern.",
                },
            },
        },
        "CS:GO Weapon Case 2": {
            "Aliases": ["оружейный 2", "оружейный кейс 2", "вепан2", "вепан 2"],
            "Mil-Spec": {
                "P250 | Hive": {
                    "floatrange": [0, 0.3],
                    "text": "A mass grave that fits snugly in the palm of your hands",
                },
                "FAMAS | Hexane": {
                    "floatrange": [0, 0.4],
                    "text": "It has been painted using a hexagon patterned hydrographic.",
                },
                "Tec-9 | Blue Titanium": {
                    "floatrange": [0, 0.04],
                    "text": "It has a titanium parts whose blue color is characteristic of an oxide layer achieved via controlled anodization at 30 volts.",
                },
                "M4A1-S | Blood Tiger": {
                    "floatrange": [0, 0.3],
                    "text": "It has been painted using a jungle tiger hydrographic.",
                },
                "SCAR-20 | Crimson Web": {
                    "floatrange": [0.06, 0.8],
                    "text": "Be careful where you walk, you never know where the web is spread",
                },
            },
            "Restricted": {
                "Dual Berettas | Hemoglobin": {
                    "floatrange": [0, 0.2],
                    "text": "It has been painted using a transparent red abstract hydrographic over a metallic base coat.",
                },
                "Nova | Graphite": {
                    "floatrange": [0, 0.12],
                    "text": "It has been painted in a polygon pattern with metallic paints of various reflectivities over a chrome base coat.",
                },
                "MP9 | Hypnotic": {
                    "floatrange": [0, 0.08],
                    "text": "You're not getting sleepy, you're passing out from blood loss",
                },
                "Five-SeveN | Case Hardened": {
                    "floatrange": [0, 1],
                    "text": "A little color never hurt anyone",
                },
            },
            "Classified": {
                "USP-S | Serum": {
                    "floatrange": [0, 0.25],
                    "text": "It has been painted in a digital pattern with metallic paints of various reflectivities over a chrome base coat.",
                },
                "P90 | Cold Blooded": {
                    "floatrange": [0, 0.08],
                    "text": "It has been painted with a chrome base coat and candied in transparent red anodized effect paint. It has then been laser-etched with a slithering snake motif.",
                },
            },
            "Covert": {
                "SSG 08 | Blood in the Water": {
                    "floatrange": [0.06, 0.2],
                    "text": "It has been airbrushed with the image of a shark.",
                },
            },
        },
        "Operation Hydra Case": {
            "Aliases": ["гидр", "hydra"],
            "Mil-Spec": {
                "USP-S | Blueprint": {
                    "floatrange": [0, 0.86],
                    "text": "Sometimes the best-laid plans go awry",
                },
                "M4A1-S | Briefing": {
                    "floatrange": [0, 0.8],
                    "text": "Everybody has a plan…",
                },
                "Tec-9 | Cut Out": {
                    "floatrange": [0, 1],
                    "text": "Spring has sprung",
                },
                "MAC-10 | Aloha": {
                    "floatrange": [0, 0.65],
                    "text": "For the noncommittal",
                },
                "MAG-7 | Hard Water": {
                    "floatrange": [0, 0.45],
                    "text": "Felix, you and I both know Valeria's about to wage a war. The only question is are you prepared? - Booth, Arms Dealer",
                },
                "FAMAS | Macabre": {
                    "floatrange": [0, 0.6],
                    "text": "A gruesome discovery",
                },
                "UMP-45 | Metal Flowers": {
                    "floatrange": [0, 0.7],
                    "text": "In memoriam",
                },
            },
            "Restricted": {
                "AK-47 | Orbit Mk01": {
                    "floatrange": [0, 0.55],
                    "text": "Recovered from COLONY01",
                },
                "P90 | Death Grip": {
                    "floatrange": [0, 1],
                    "text": "Do not go quietly",
                },
                "P2000 | Woodsman": {
                    "floatrange": [0, 0.8],
                    "text": "«The orange is for you, not me»",
                },
                "SSG 08 | Death's Head": {
                    "floatrange": [0, 0.51],
                    "text": "Quid pro quo",
                },
                "P250 | Red Rock": {
                    "floatrange": [0, 1],
                    "text": "Just over the horizon",
                },
            },
            "Classified": {
                "M4A4 | Hellfire": {
                    "floatrange": [0, 0.5],
                    "text": "And brim pebbles",
                },
                "Galil AR | Sugar Rush": {
                    "floatrange": [0, 0.55],
                    "text": "Prepare for the crash",
                },
                "Dual Berettas | Cobra Strike": {
                    "floatrange": [0, 0.6],
                    "text": "They always strike back",
                },
            },
            "Covert": {
                "AWP | Oni Taiji": {
                    "floatrange": [0, 0.5],
                    "text": "Face your demons",
                },
                "Five-SeveN | Hyper Beast": {
                    "floatrange": [0, 1],
                    "text": "We're all monsters",
                },
            },
        },
        "Winter Offensive Weapon Case": {
            "Aliases": ["winter", "винтер", "зимн"],
            "Mil-Spec": {
                "Galil AR | Sandstorm": {
                    "floatrange": [0.1, 0.6],
                    "text": "It'll take more than a tarp to protect you",
                },
                "PP-Bizon | Cobalt Halftone": {
                    "floatrange": [0.05, 0.45],
                    "text": "Felix, you and I both know Valeria's about to wage a war. The only question is are you prepared? - Booth, Arms Dealer",
                },
                "Five-SeveN | Kami": {
                    "floatrange": [0, 0.3],
                    "text": "Some ghosts won't stay buried",
                },
                "M249 | Magma": {
                    "floatrange": [0, 0.7],
                    "text": "A burning rate of fire",
                },
            },
            "Restricted": {
                "MP9 | Rose Iron": {
                    "floatrange": [0, 0.3],
                    "text": "Beware its many thorns",
                },
                "Dual Berettas | Marina": {
                    "floatrange": [0.05, 0.5],
                    "text": "Some people will call you a hero... others a villain",
                },
                "FAMAS | Pulse": {
                    "floatrange": [0, 0.4],
                    "text": "Striking colors for a striking weapon",
                },
                "Nova | Rising Skull": {
                    "floatrange": [0, 0.5],
                    "text": "Mr. Izaki, I'm not complaining... but how many shotguns do you need? - Imogen and The Oni, Part 1",
                },
            },
            "Classified": {
                "AWP | Redline": {
                    "floatrange": [0.1, 0.4],
                    "text": "Never be afraid to push it to the limit",
                },
                "M4A1-S | Guardian": {
                    "floatrange": [0, 0.5],
                    "text": "I don't have to like you, I have to keep you safe - Carmen Cocinero, Extraction Expert",
                },
                "P250 | Mehndi": {
                    "floatrange": [0, 1],
                    "text": "Namaste",
                },
            },
            "Covert": {
                "M4A4 | Asiimov": {
                    "floatrange": [0.18, 1],
                    "text": "Anyone can predict the future... a visionary shapes it",
                },
                "Sawed-Off | The Kraken": {
                    "floatrange": [0, 0.4],
                    "text": "It has been unleashed",
                },
            },
        },
        "Operation Vanguard Weapon Case": {
            "Aliases": ["вангард", "vanguard"],
            "Mil-Spec": {
                "MAG-7 | Firestarter": {
                    "floatrange": [0.06, 0.49],
                    "text": "It always begins with a tiny spark",
                },
                "UMP-45 | Delusion": {
                    "floatrange": [0.06, 0.35],
                    "text": "Carcosa is calling",
                },
                "Five-SeveN | Urban Hazard": {
                    "floatrange": [0, 0.25],
                    "text": "Every year, Booth gathers the worlds foremost designer gunsmiths to show off their latest designs",
                },
                "MP9 | Dart": {
                    "floatrange": [0, 0.46],
                    "text": "Throw enough downfield and you're bound to hit the bullseye eventually",
                },
                "G3SG1 | Murky": {
                    "floatrange": [0, 0.25],
                    "text": "There is always some place darker you can go",
                },
            },
            "Restricted": {
                "M4A4 | Griffin": {
                    "floatrange": [0, 0.8],
                    "text": "Felix handpicked his team from operators all over the world... and while people question their personalities, they never question the results",
                },
                "M4A1-S | Basilisk": {
                    "floatrange": [0, 0.68],
                    "text": "It's rude to stare, but war isn't the time for pleasantries",
                },
                "Glock-18 | Grinder": {
                    "floatrange": [0.02, 0.25],
                    "text": "The only way to make diamonds is by applying pressure",
                },
                "Sawed-Off | Highwayman": {
                    "floatrange": [0, 1],
                    "text": "You don't have to hold your pinky out when pulling the trigger, but it's a nice touch",
                },
            },
            "Classified": {
                "XM1014 | Tranquility": {
                    "floatrange": [0, 0.5],
                    "text": "I'm not here for what I need; I'm here for something I want - Imogen and The Oni Part 2",
                },
                "P250 | Cartel": {
                    "floatrange": [0, 0.75],
                    "text": "One little squeeze turns every morning into the Day of the Dead",
                },
                "SCAR-20 | Cardiac": {
                    "floatrange": [0, 1],
                    "text": "beep. beep. beeeeeeeeeeeep...",
                },
            },
            "Covert": {
                "AK-47 | Wasteland Rebel": {
                    "floatrange": [0.05, 0.7],
                    "text": "One day they will ask why we fight, and when they do they will understand - Naomi, Bodyguard to Valeria Jenner",
                },
                "P2000 | Fire Elemental": {
                    "floatrange": [0, 0.6],
                    "text": "Sometimes playing with fire is a good thing",
                },
            },
        },
        "Gamma 2 Case": {
            "Aliases": ["gamma 2", "гамма 2"],
            "Mil-Spec": {
                "XM1014 | Slipstream": {
                    "floatrange": [0, 0.5],
                    "text": "Patience, Elliott; they still have a role to play... - The Mercenary and The Serpent Part 2",
                },
                "G3SG1 | Ventilator": {
                    "floatrange": [0, 0.45],
                    "text": "Don't worry Naomi, I'll make Felix pay - Mikha Biton, Phoenix Sniper",
                },
                "CZ75-Auto | Imprint": {
                    "floatrange": [0, 1],
                    "text": "Couture firearms have taken the Czech Republic by storm",
                },
                "Five-SeveN | Scumbria": {
                    "floatrange": [0, 1],
                    "text": "You can't leave him to die, Felix; you have to save him - The Daughter and the Paladin Part 1",
                },
                "UMP-45 | Briefing": {
                    "floatrange": [0, 1],
                    "text": "This is going to be a short meeting...",
                },
                "Negev | Dazzle": {
                    "floatrange": [0.1, 0.65],
                    "text": "Finally, a gun for trivia lovers",
                },
                "P90 | Grim": {
                    "floatrange": [0, 0.8],
                    "text": "Imogen... are you selling me a gun or a velvet poster? – Rona Sabri, Rising Star",
                },
            },
            "Restricted": {
                "SCAR-20 | Powercore": {
                    "floatrange": [0, 1],
                    "text": "Rule No. 1 – Challenge demands satisfaction",
                },
                "MAG-7 | Petroglyph": {
                    "floatrange": [0, 0.44],
                    "text": "Conflict existed since the first caveman learned how to pick up a rock – Booth, Arms Dealer",
                },
                "SG 553 | Triarch": {
                    "floatrange": [0, 1],
                    "text": "Remind them of your love",
                },
                "Glock-18 | Weasel": {
                    "floatrange": [0, 1],
                    "text": "Just because he's cute, doesn't mean he doesn't bite",
                },
                "Desert Eagle | Directive": {
                    "floatrange": [0.06, 1],
                    "text": "Your move...",
                },
            },
            "Classified": {
                "AUG | Syd Mead": {
                    "floatrange": [0, 0.8],
                    "text": "In the past he gave us visions of the future; in the present he placed the future in our hands...",
                },
                "MP9 | Airlock": {
                    "floatrange": [0, 1],
                    "text": "Perfect for shooting toasters",
                },
                "Tec-9 | Fuel Injector": {
                    "floatrange": [0, 1],
                    "text": "Pit crew not included",
                },
            },
            "Covert": {
                "AK-47 | Neon Revolution": {
                    "floatrange": [0, 0.8],
                    "text": "No suicide squad would be complete without it",
                },
                "FAMAS | Roll Cage": {
                    "floatrange": [0, 1],
                    "text": "Safety first",
                },
            },
        },
        "Gamma Case": {
            "Aliases": ["гамма", "gamma"],
            "Mil-Spec": {
                "PP-Bizon | Harvester": {
                    "floatrange": [0, 1],
                    "text": "Biomechanic experimentation gone right",
                },
                "P250 | Iron Clad": {
                    "floatrange": [0.05, 0.8],
                    "text": "Reliability and safety guaranteed",
                },
                "MAC-10 | Carnivore": {
                    "floatrange": [0, 1],
                    "text": "Prepare before serving",
                },
                "Nova | Exo": {
                    "floatrange": [0, 0.5],
                    "text": "It's what's inside that counts",
                },
                "SG 553 | Aerial": {
                    "floatrange": [0, 0.6],
                    "text": "Establish air superiority",
                },
                "Tec-9 | Ice Cap": {
                    "floatrange": [0, 0.5],
                    "text": "Submerge the opposition",
                },
                "Five-SeveN | Violent Daimyo": {
                    "floatrange": [0, 0.7],
                    "text": "How will you rule?",
                },
            },
            "Restricted": {
                "Sawed-Off | Limelight": {
                    "floatrange": [0, 1],
                    "text": "All eyes on you",
                },
                "AUG | Aristocrat": {
                    "floatrange": [0, 0.66],
                    "text": "For the 1%",
                },
                "P90 | Chopper": {
                    "floatrange": [0, 0.6],
                    "text": "Clutch not included",
                },
                "R8 Revolver | Reboot": {
                    "floatrange": [0, 1],
                    "text": "«Have you tried turning it off and on again?»",
                },
                "AWP | Phobos": {
                    "floatrange": [0, 0.4],
                    "text": "Build a better world",
                },
            },
            "Classified": {
                "P2000 | Imperial Dragon": {
                    "floatrange": [0, 0.63],
                    "text": "Look to the West",
                },
                "SCAR-20 | Bloodsport": {
                    "floatrange": [0, 0.45],
                    "text": "CT-side sponsored by…",
                },
                "M4A4 | Desolate Space": {
                    "floatrange": [0, 1],
                    "text": "«We've lost contact»",
                },
            },
            "Covert": {
                "M4A1-S | Mecha Industries": {
                    "floatrange": [0, 0.8],
                    "text": "Featuring all new technology",
                },
                "Glock-18 | Wasteland Rebel": {
                    "floatrange": [0, 0.54],
                    "text": "Pay tribute",
                },
            },
        },
        "Spectrum 2 Case": {
            "Aliases": ["spectrum 2", "спектр 2"],
            "Mil-Spec": {
                "Glock-18 | Off World": {
                    "floatrange": [0, 1],
                    "text": "The topcoat is still drying",
                },
                "AUG | Triqua": {
                    "floatrange": [0, 1],
                    "text": "All things being equal",
                },
                "MAC-10 | Oceanic": {
                    "floatrange": [0, 0.6],
                    "text": "The shapeless void",
                },
                "Tec-9 | Cracked Opal": {
                    "floatrange": [0, 1],
                    "text": "Doubles as a mood ring",
                },
                "Sawed-Off | Morris": {
                    "floatrange": [0, 1],
                    "text": "Close quarters nouveau",
                },
                "G3SG1 | Hunter": {
                    "floatrange": [0, 1],
                    "text": "It smells of rich mahogany",
                },
                "SCAR-20 | Jungle Slipstream": {
                    "floatrange": [0, 0.5],
                    "text": "Create your own wake",
                },
            },
            "Restricted": {
                "MP9 | Goo": {
                    "floatrange": [0, 0.6],
                    "text": "Covered in spite",
                },
                "SG 553 | Phantom": {
                    "floatrange": [0, 0.6],
                    "text": "A ScyTech procurement",
                },
                "CZ75-Auto | Tacticat": {
                    "floatrange": [0, 0.7],
                    "text": "24 bullets, 9 lives",
                },
                "XM1014 | Ziggy": {
                    "floatrange": [0, 0.72],
                    "text": "Introduce a little anarchy",
                },
                "UMP-45 | Exposure": {
                    "floatrange": [0, 0.55],
                    "text": "«Please remove all metal objects from your pockets»",
                },
            },
            "Classified": {
                "M4A1-S | Leaded Glass": {
                    "floatrange": [0, 0.7],
                    "text": "Lethal fragility",
                },
                "PP-Bizon | High Roller": {
                    "floatrange": [0, 1],
                    "text": "All in",
                },
                "R8 Revolver | Llama Cannon": {
                    "floatrange": [0.03, 0.7],
                    "text": "Pull the lever",
                },
            },
            "Covert": {
                "AK-47 | The Empress": {
                    "floatrange": [0, 1],
                    "text": "Wealth comes in many forms",
                },
                "P250 | See Ya Later": {
                    "floatrange": [0, 0.7],
                    "text": "In a while…",
                },
            },
        },
        "Spectrum Case": {
            "Aliases": ["spectrum", "спектр"],
            "Mil-Spec": {
                "Sawed-Off | Zander": {
                    "floatrange": [0.05, 1],
                    "text": "This one's a keeper",
                },
                "MP7 | Akoben": {
                    "floatrange": [0, 0.7],
                    "text": "Your personal battle cry",
                },
                "PP-Bizon | Jungle Slipstream": {
                    "floatrange": [0, 0.5],
                    "text": "Follow the leader",
                },
                "P250 | Ripple": {
                    "floatrange": [0, 0.5],
                    "text": "Be the pebble",
                },
                "SCAR-20 | Blueprint": {
                    "floatrange": [0, 0.75],
                    "text": "The best-laid plans are drawn to scale",
                },
                "Five-SeveN | Capillary": {
                    "floatrange": [0, 0.7],
                    "text": "20 over 100",
                },
                "Desert Eagle | Oxide Blaze": {
                    "floatrange": [0, 0.5],
                    "text": "Nothing a little sandpaper can't fix",
                },
            },
            "Restricted": {
                "MAC-10 | Last Dive": {
                    "floatrange": [0, 0.52],
                    "text": "There's beauty in chaos",
                },
                "UMP-45 | Scaffold": {
                    "floatrange": [0, 1],
                    "text": "Brick by brick",
                },
                "M249 | Emerald Poison Dart": {
                    "floatrange": [0, 0.45],
                    "text": "Conservation is not a priority",
                },
                "Galil AR | Crimson Tsunami": {
                    "floatrange": [0, 0.55],
                    "text": "Westward breaks",
                },
                "XM1014 | Seasons": {
                    "floatrange": [0, 0.5],
                    "text": "Spring, summer, fall, and rarely winter",
                },
            },
            "Classified": {
                "CZ75-Auto | Xiangliu": {
                    "floatrange": [0, 0.56],
                    "text": "Beware the rising tide",
                },
                "AWP | Fever Dream": {
                    "floatrange": [0, 0.55],
                    "text": "Delirium is a dangerous thing",
                },
                "M4A1-S | Decimator": {
                    "floatrange": [0, 0.85],
                    "text": "Quiet retrofuturism",
                },
            },
            "Covert": {
                "AK-47 | Bloodsport": {
                    "floatrange": [0, 0.45],
                    "text": "Co-driver wanted",
                },
                "USP-S | Neo-Noir": {
                    "floatrange": [0, 0.7],
                    "text": "«Drenched in a neon glow, she lies at the foot of an oppressive skyscraper»",
                },
            },
        },
        "Danger Zone Case": {
            "Aliases": [
                "запретная зона",
                "дэнжерзон",
                "danger zone",
                "данжерзон",
                "данжер зон",
                "дэнжер зон",
            ],
            "Mil-Spec": {
                "Nova | Wood Fired": {
                    "floatrange": [0, 0.75],
                    "text": "Gone hunting",
                },
                "Sawed-Off | Black Sand": {
                    "floatrange": [0, 0.9],
                    "text": "Mikah did not account for highly motivated opposition",
                },
                "SG 553 | Danger Close": {
                    "floatrange": [0.02, 0.8],
                    "text": "Watch your fire",
                },
                "MP9 | Modest Threat": {
                    "floatrange": [0, 0.75],
                    "text": "Be the last 01 standing",
                },
                "Glock-18 | Oxide Blaze": {
                    "floatrange": [0, 0.85],
                    "text": "«The subject claims this washed up on shore»",
                },
                "Tec-9 | Fubar": {
                    "floatrange": [0.14, 1],
                    "text": "You call it used, we call it well-loved",
                },
                "M4A4 | Magnesium": {
                    "floatrange": [0, 1],
                    "text": "For those who live fast",
                },
            },
            "Restricted": {
                "G3SG1 | Scavenger": {
                    "floatrange": [0, 0.65],
                    "text": "Why run?",
                },
                "Galil AR | Signal": {
                    "floatrange": [0, 0.5],
                    "text": "Information is never free",
                },
                "MAC-10 | Pipe Down": {
                    "floatrange": [0, 0.9],
                    "text": "Peek behind the curtain",
                },
                "P250 | Nevermore": {
                    "floatrange": [0, 0.4],
                    "text": "Claim your spot in the pecking order",
                },
                "USP-S | Flashback": {
                    "floatrange": [0, 0.5],
                    "text": "Sierra Hotel Hotel Hotel",
                },
            },
            "Classified": {
                "Desert Eagle | Mecha Industries": {
                    "floatrange": [0, 0.6],
                    "text": "Same technology, now available in a smaller form factor",
                },
                "MP5-SD | Phosphor": {
                    "floatrange": [0, 0.8],
                    "text": "+Stand out from the crowd",
                },
                "UMP-45 | Momentum": {
                    "floatrange": [0, 0.5],
                    "text": "Always moving forward",
                },
            },
            "Covert": {
                "AK-47 | Asiimov": {
                    "floatrange": [0.05, 0.7],
                    "text": "Anyone can predict the future... a visionary shapes it",
                },
                "AWP | Neo-Noir": {
                    "floatrange": [0, 0.5],
                    "text": "«They took comfort in each other's despair»",
                },
            },
        },
        "Horizon Case": {
            "Aliases": ["горизонт", "хорайзон"],
            "Mil-Spec": {
                "AUG | Amber Slipstream": {
                    "floatrange": [0, 0.55],
                    "text": "Please keep your hands and arms inside the vehicle",
                },
                "Dual Berettas | Shred": {
                    "floatrange": [0, 0.5],
                    "text": "Sometimes the gnar shreds you",
                },
                "R8 Revolver | Survivalist": {
                    "floatrange": [0, 0.7],
                    "text": "«Eight shots and multiple enemies; better make them count»",
                },
                "MP9 | Capillary": {
                    "floatrange": [0, 0.7],
                    "text": "857 bpm",
                },
                "Tec-9 | Snek-9": {
                    "floatrange": [0, 1],
                    "text": "«If red meets yellow, you're a dead fellow»",
                },
                "P90 | Traction": {
                    "floatrange": [0, 1],
                    "text": "Half the battle is keeping a hold of the weapon; the other half is hitting the target",
                },
                "Glock-18 | Warhawk": {
                    "floatrange": [0, 1],
                    "text": "It may not the best plane on deck, but it is the most readily available",
                },
            },
            "Restricted": {
                "AWP | PAW": {
                    "floatrange": [0, 0.5],
                    "text": "Kill rewards paid in scratching posts and tennis balls",
                },
                "CZ75-Auto | Eco": {
                    "floatrange": [0, 1],
                    "text": "For a better tomorrow",
                },
                "Nova | Toy Soldier": {
                    "floatrange": [0, 1],
                    "text": "Pellets and soldiers delivered in bulk",
                },
                "G3SG1 | High Seas": {
                    "floatrange": [0, 0.7],
                    "text": "Let dead reckoning be your guide",
                },
                "MP7 | Powercore": {
                    "floatrange": [0, 0.8],
                    "text": "Rule No. 2 – Never clash in public",
                },
            },
            "Classified": {
                "M4A1-S | Nightmare": {
                    "floatrange": [0, 1],
                    "text": "Next time set an alarm",
                },
                "FAMAS | Eye of Athena": {
                    "floatrange": [0, 0.7],
                    "text": "+1 to Wisdom",
                },
                "Sawed-Off | Devourer": {
                    "floatrange": [0, 0.8],
                    "text": "It’s rude to talk with food in your mouth",
                },
            },
            "Covert": {
                "AK-47 | Neon Rider": {
                    "floatrange": [0, 0.8],
                    "text": "Two parts Trapper Keeper, three parts synthesizer",
                },
                "Desert Eagle | Code Red": {
                    "floatrange": [0, 1],
                    "text": "Man your stations",
                },
            },
        },
        "Chroma 2 Case": {
            "Aliases": ["хрома 2"],
            "Mil-Spec": {
                "Negev | Man-o'-war": {
                    "floatrange": [0.1, 0.2],
                    "text": "Turn some heads before you take them off",
                },
                "Sawed-Off | Origami": {
                    "floatrange": [0, 0.55],
                    "text": "It takes time to build something beautiful, but only a moment to destroy it",
                },
                "MP7 | Armor Core": {
                    "floatrange": [0, 0.5],
                    "text": "Perfect for the Operator that values sophistication as well as firepower - Booth, Arms Dealer",
                },
                "P250 | Valence": {
                    "floatrange": [0, 0.8],
                    "text": "Your skills aren't in question, your attitude is - The Teacher and The Iconoclast Part 1",
                },
                "Desert Eagle | Bronze Deco": {
                    "floatrange": [0, 0.46],
                    "text": "Everyone's searching for silver and gold",
                },
                "AK-47 | Elite Build": {
                    "floatrange": [0, 1],
                    "text": "Tread softly Naomi... People in your line of work aren't known for their longevity - The Shield and The Serpent Part 2",
                },
            },
            "Restricted": {
                "UMP-45 | Grand Prix": {
                    "floatrange": [0.25, 0.35],
                    "text": "Don't forget your helmet",
                },
                "CZ75-Auto | Pole Position": {
                    "floatrange": [0, 0.7],
                    "text": "We only get one chance at this, let's do it right - Felix Riley, Commanding Officer",
                },
                "MAG-7 | Heat": {
                    "floatrange": [0, 1],
                    "text": "Make some outlines of your own",
                },
                "AWP | Worm God": {
                    "floatrange": [0, 0.45],
                    "text": "There are some roots you don't want to take hold",
                },
            },
            "Classified": {
                "FAMAS | Djinn": {
                    "floatrange": [0, 1],
                    "text": "Be careful what you wish for",
                },
                "Five-SeveN | Monkey Business": {
                    "floatrange": [0.1, 0.9],
                    "text": "Sometimes it's ok to play with your food",
                },
                "Galil AR | Eco": {
                    "floatrange": [0.1, 0.85],
                    "text": "For enough money, Elite Crew will take any cause on as their own",
                },
            },
            "Covert": {
                "M4A1-S | Hyper Beast": {
                    "floatrange": [0, 1],
                    "text": "You really want to impress me Booth? Make this black light sensitive - Rona Sabri, Rising Star",
                },
                "MAC-10 | Neon Rider": {
                    "floatrange": [0, 0.45],
                    "text": "One part firearm, two parts Trapper Keeper",
                },
            },
        },
        "Chroma 3 Case": {
            "Aliases": ["хрома 3"],
            "Mil-Spec": {
                "M249 | Spectre": {
                    "floatrange": [0, 0.5],
                    "text": "The Phoenix civil war is about to begin",
                },
                "G3SG1 | Orange Crash": {
                    "floatrange": [0, 0.52],
                    "text": "Become a modern day Shere Khan",
                },
                "P2000 | Oceanic": {
                    "floatrange": [0, 0.6],
                    "text": "Has anyone heard from Kotaro or Carmen? - Felix Riley, Commanding Officer",
                },
                "SG 553 | Atlas": {
                    "floatrange": [0, 0.81],
                    "text": " It was once a design earmarked for the Coalition Taskforce, but Huxley engaged in corporate espionage to make it a Phoenix exclusive",
                },
                "Dual Berettas | Ventilators": {
                    "floatrange": [0, 0.45],
                    "text": "A weapon for artists, by artists",
                },
                "Sawed-Off | Fubar": {
                    "floatrange": [0.4, 1],
                    "text": "It starts with a bang... it ends with silence",
                },
                "MP9 | Bioleak": {
                    "floatrange": [0, 0.5],
                    "text": "BEWARE DIRECT EXPOSURE",
                },
            },
            "Restricted": {
                "CZ75-Auto | Red Astor": {
                    "floatrange": [0, 1],
                    "text": "Booth has become synonymous with family drama; and who has time for drama when we're talking business - Huxley, The Competition",
                },
                "Galil AR | Firefight": {
                    "floatrange": [0, 1],
                    "text": "Booth had this weapon commissioned for Valeria in an attempt to smooth things over with the Phoenix",
                },
                "Tec-9 | Re-Entry": {
                    "floatrange": [0, 0.43],
                    "text": "I hate being right all the time - Carmen Cocinero, Extraction Expert",
                },
                "XM1014 | Black Tie": {
                    "floatrange": [0, 0.75],
                    "text": "We have Izaki and Cocinero. You need them for anything or can I just kill them now? - The Mercenary and The Serpent Part 1",
                },
                "SSG 08 | Ghost Crusader": {
                    "floatrange": [0, 1],
                    "text": "I can never replace what was taken from us... but I can take even more from them - The Phoenix and The Initiate Part 2",
                },
            },
            "Classified": {
                "UMP-45 | Primal Saber": {
                    "floatrange": [0, 0.77],
                    "text": "Every predator eventually meets their end",
                },
                "AUG | Fleet Flock": {
                    "floatrange": [0, 1],
                    "text": "Some birds represent harmony and peace... these are not those birds",
                },
                "P250 | Asiimov": {
                    "floatrange": [0.1, 1],
                    "text": "If you think I need a rifle to kill a man, you have no idea who you're talking to... - Mikha Biton, Phoenix Sniper",
                },
            },
            "Covert": {
                "M4A1-S | Chantico's Fire": {
                    "floatrange": [0, 0.99],
                    "text": "Protect what is yours",
                },
                "PP-Bizon | Judgement of Anubis": {
                    "floatrange": [0, 0.5],
                    "text": "Its trigger weighs lighter than a feather",
                },
            },
        },
        "Chroma Case": {
            "Aliases": ["хромированный", "хрома"],
            "Mil-Spec": {
                "XM1014 | Quicksilver": {
                    "floatrange": [0, 0.5],
                    "text": "Sometimes you need an unstable element to solve your problems - Kotaro Izaki, Breach Expert",
                },
                "SCAR-20 | Grotto": {
                    "floatrange": [0, 0.5],
                    "text": "The founder of Season Corporation had this piece commissioned after being rescued by renowned Operator Kotaro Izaki",
                },
                "M249 | System Lock": {
                    "floatrange": [0, 0.8],
                    "text": "Coverfire never looked so good",
                },
                "Glock-18 | Catacombs": {
                    "floatrange": [0, 0.5],
                    "text": "Intimidation is the sincerest form of flattery",
                },
                "MP9 | Deadly Poison": {
                    "floatrange": [0, 1],
                    "text": "It's not the first bite that kills you, it's the 29 that come after",
                },
            },
            "Restricted": {
                "Dual Berettas | Urban Shock": {
                    "floatrange": [0, 0.47],
                    "text": "With lightning always comes thunder",
                },
                "MAC-10 | Malachite": {
                    "floatrange": [0, 0.5],
                    "text": "Bright colors hide a gun with a dark purpose",
                },
                "Sawed-Off | Serenity": {
                    "floatrange": [0, 0.5],
                    "text": "Serenity is a luxury few can afford - Valeria Jenner, Revolutionary",
                },
                "Desert Eagle | Naga": {
                    "floatrange": [0, 1],
                    "text": "A beast in Indian mythology as well as on the battlefield",
                },
            },
            "Classified": {
                "P250 | Muertos": {
                    "floatrange": [0, 0.6],
                    "text": "This one is steeped in tradition and blood",
                },
                "AK-47 | Cartel": {
                    "floatrange": [0, 0.75],
                    "text": "One little squeeze turns every morning into the Day of the Dead",
                },
                "M4A4 | 龍王 (Dragon King)": {
                    "floatrange": [0, 0.75],
                    "text": "A weapon worthy of The Monkey King himself - Booth, Arms Dealer",
                },
            },
            "Covert": {
                "Galil AR | Chatterbox": {
                    "floatrange": [0.35, 0.85],
                    "text": "Some say that when you laugh, the world laughs with you...but when Chatterbox laughs there are only screams",
                },
                "AWP | Man-o'-war": {
                    "floatrange": [0.1, 0.2],
                    "text": "Turn some heads before you take them off",
                },
            },
        },
        "Huntsman Weapon Case": {
            "Aliases": ["охотничий", "хантсман"],
            "Mil-Spec": {
                "SSG 08 | Slashed": {
                    "floatrange": [0.15, 0.8],
                    "text": "It has been painted using a hydrographic in a claw mark pattern.",
                },
                "Galil AR | Kami": {
                    "floatrange": [0, 0.6],
                    "text": "Some ghosts won't stay buried",
                },
                "Tec-9 | Isaac": {
                    "floatrange": [0, 1],
                    "text": "It has been custom painted with a sci-fi design.",
                },
                "P2000 | Pulse": {
                    "floatrange": [0, 0.6],
                    "text": "Striking colors for a striking weapon",
                },
                "CZ75-Auto | Twist": {
                    "floatrange": [0, 1],
                    "text": "It has been painted with a spiral design leaving the handle white.",
                },
                "P90 | Module": {
                    "floatrange": [0, 0.35],
                    "text": "It has been painted using metallic paints with an overlayed hexagonal pattern.",
                },
            },
            "Restricted": {
                "AUG | Torque": {
                    "floatrange": [0, 0.5],
                    "text": "It has been custom painted with a robotics inspired pattern.",
                },
                "XM1014 | Heaven Guard": {
                    "floatrange": [0.03, 0.5],
                    "text": "Sometimes the wings of an angel don't mean salvation",
                },
                "PP-Bizon | Antique": {
                    "floatrange": [0, 0.5],
                    "text": "With age comes wisdom and stopping power",
                },
                "MAC-10 | Tatter": {
                    "floatrange": [0, 0.5],
                    "text": "It has been custom painted with a high-tech design reminiscent of flames.",
                },
            },
            "Classified": {
                "M4A1-S | Atomic Alloy": {
                    "floatrange": [0, 0.9],
                    "text": "It has been anodized black and orange.",
                },
                "SCAR-20 | Cyrex": {
                    "floatrange": [0, 0.5],
                    "text": "It has been custom painted with a high-tech design in black, white, and red.",
                },
                "USP-S | Caiman": {
                    "floatrange": [0, 0.4],
                    "text": "It has been custom painted with an image of a Caiman.",
                },
            },
            "Covert": {
                "M4A4 | Desert-Strike": {
                    "floatrange": [0, 0.7],
                    "text": "It has been custom painted with a high-tech design in tan and black.",
                },
                "AK-47 | Vulcan": {
                    "floatrange": [0, 0.9],
                    "text": "It has been custom painted in a sports inspired design.",
                },
            },
            "Special": {
                "Huntsman Knife | Slaughter": {
                    "floatrange": [0.01, 0.26],
                    "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
                },
                "Huntsman Knife": {
                    "floatrange": [0, 1],
                    "text": "Vanilla",
                },
                "Huntsman Knife | Blue Steel": {
                    "floatrange": [0, 1],
                    "text": "This is the malbec of weapon design - Booth, Arms Dealer",
                },
                "Huntsman Knife | Crimson Web": {
                    "floatrange": [0.06, 0.8],
                    "text": "Be careful where you walk, you never know where the web is spread",
                },
                "Huntsman Knife | Case Hardened": {
                    "floatrange": [0, 1],
                    "text": "A little color never hurt anyone",
                },
                "Huntsman Knife | Night": {
                    "floatrange": [0.06, 0.8],
                    "text": "It's the whisper of the wind... it's the bite at your neck",
                },
                "Huntsman Knife | Stained": {
                    "floatrange": [0, 1],
                    "text": "If you think it's messy now, wait until you see it under a blacklight",
                },
                "Huntsman Knife | Forest DDPAT": {
                    "floatrange": [0.06, 0.8],
                    "text": "By the time you're close enough to notice the pixels it's already too late",
                },
                "Huntsman Knife | Boreal Forest": {
                    "floatrange": [0.06, 0.8],
                    "text": "The woods can be a dangerous place... never travel alone",
                },
                "Huntsman Knife | Safari Mesh": {
                    "floatrange": [0.06, 0.8],
                    "text": "A predator is a predator, no matter the environment",
                },
                "Huntsman Knife | Urban Masked": {
                    "floatrange": [0.06, 0.8],
                    "text": "True power is demonstrated with subtle application",
                },
                "Huntsman Knife | Scorched": {
                    "floatrange": [0.06, 0.8],
                    "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
                },
                "Huntsman Knife | Fade": {
                    "floatrange": [0, 0.08],
                    "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
                },
            },
        },
        "Fracture Case": {
            "Aliases": ["fracture", "фракчур", "разлом"],
            "Mil-Spec": {
                "SG 553 | Ol' Rusty": {
                    "floatrange": [0, 0.7],
                    "text": "A rusty, trusty friend",
                },
                "Negev | Ultralight": {
                    "floatrange": [0, 0.79],
                    "text": "Got a light?",
                },
                "P90 | Freight": {
                    "floatrange": [0, 1],
                    "text": "Art is not vandalism",
                },
                "P2000 | Gnarled": {
                    "floatrange": [0, 1],
                    "text": "From the dark corners of the infinite void",
                },
                "P250 | Cassette": {
                    "floatrange": [0, 0.9],
                    "text": "Check the tape",
                },
                "PP-Bizon | Runic": {
                    "floatrange": [0, 1],
                    "text": "Give 'em hell",
                },
                "SSG 08 | Mainframe 001": {
                    "floatrange": [0, 1],
                    "text": "What secrets does _001 hold?",
                },
            },
            "Restricted": {
                "Tec-9 | Brother": {
                    "floatrange": [0, 1],
                    "text": "I'll watch our butts",
                },
                "Galil AR | Connexion": {
                    "floatrange": [0, 0.8],
                    "text": "They're bringing in the big guns",
                },
                "MP5-SD | Kitbash": {
                    "floatrange": [0, 0.8],
                    "text": "If at first (and second and third) you don't succeed…",
                },
                "MAC-10 | Allure": {
                    "floatrange": [0, 1],
                    "text": "Beauty begets bloodshed",
                },
                "MAG-7 | Monster Call": {
                    "floatrange": [0, 1],
                    "text": "There's always a bigger, greener fish",
                },
            },
            "Classified": {
                "XM1014 | Entombed": {
                    "floatrange": [0, 0.5],
                    "text": "Fit for a pharaoh",
                },
                "Glock-18 | Vogue": {
                    "floatrange": [0, 0.75],
                    "text": "«Look at me while I'm shooting at you!»",
                },
                "M4A4 | Tooth Fairy": {
                    "floatrange": [0, 0.73],
                    "text": "No one said the teeth have to be yours…",
                },
            },
            "Covert": {
                "Desert Eagle | Printstream": {
                    "floatrange": [0, 0.8],
                    "text": "WHITE_1; BLACK_1; PEARLESCENT_1;",
                },
                "AK-47 | Legion of Anubis": {
                    "floatrange": [0, 0.7],
                    "text": "May he tip the scales in your favor",
                },
            },
        },
        "CS:GO Weapon Case": {
            "Aliases": ["оружейный", "вепан1", "крылья", "вепан 1"],
            "Mil-Spec": {
                "MP7 | Skulls": {
                    "floatrange": [0.1, 0.26],
                    "text": "A mass grave that fits snugly in the palm of your hands",
                },
                "AUG | Wings": {
                    "floatrange": [0, 0.14],
                    "text": "An eagle looks majestic until it's clawing your eyes out",
                },
                "SG 553 | Ultraviolet": {
                    "floatrange": [0.06, 0.8],
                    "text": "Elegant design paired with brutal intent",
                },
            },
            "Restricted": {
                "USP-S | Dark Water": {
                    "floatrange": [0.1, 0.26],
                    "text": "Water gives life, but it can also take it...",
                },
                "M4A1-S | Dark Water": {
                    "floatrange": [0.1, 0.26],
                    "text": "Water gives life, but it can also take it...",
                },
                "Glock-18 | Dragon Tattoo": {
                    "floatrange": [0, 0.08],
                    "text": "In a fairy tale the knight always slays the dragon... but this is the real world - Valeria Jenner, Revolutionary",
                },
            },
            "Classified": {
                "Desert Eagle | Hypnotic": {
                    "floatrange": [0, 0.08],
                    "text": "You're not getting sleepy, you're passing out from blood loss",
                },
                "AK-47 | Case Hardened": {
                    "floatrange": [0, 1],
                    "text": "A little color never hurt anyone",
                },
            },
            "Covert": {
                "AWP | Lightning Strike": {
                    "floatrange": [0, 0.08],
                    "text": "Sometimes you don't need to strike the same place twice",
                },
            },
        },
        "Clutch Case": {
            "Aliases": ["решающий момент", "клатч", "clutch"],
            "Mil-Spec": {
                "XM1014 | Oxide Blaze": {
                    "floatrange": [0, 0.7],
                    "text": "Not to be used as a load-bearing support",
                },
                "PP-Bizon | Night Riot": {
                    "floatrange": [0, 0.8],
                    "text": "Cause an uproar",
                },
                "SG 553 | Aloha": {
                    "floatrange": [0, 0.55],
                    "text": "The perfect partner",
                },
                "P2000 | Urban Hazard": {
                    "floatrange": [0, 1],
                    "text": "Hard hats required beyond this point",
                },
                "Five-SeveN | Flame Test": {
                    "floatrange": [0, 0.65],
                    "text": "Element detected: Cs",
                },
                "MP9 | Black Sand": {
                    "floatrange": [0, 1],
                    "text": "«End their campaign before it begins»",
                },
                "R8 Revolver | Grip": {
                    "floatrange": [0, 1],
                    "text": "Every enemy is a nail",
                },
            },
            "Restricted": {
                "Negev | Lionfish": {
                    "floatrange": [0, 0.55],
                    "text": "Just keep swimming",
                },
                "Nova | Wild Six": {
                    "floatrange": [0, 0.8],
                    "text": "My gun, my rules",
                },
                "UMP-45 | Arctic Wolf": {
                    "floatrange": [0, 0.8],
                    "text": "Every round is a 1v5",
                },
                "MAG-7 | SWAG-7": {
                    "floatrange": [0, 0.92],
                    "text": "You either have it or you don't",
                },
                "Glock-18 | Moonrise": {
                    "floatrange": [0, 0.65],
                    "text": "Look for the North Star",
                },
            },
            "Classified": {
                "AUG | Stymphalian": {
                    "floatrange": [0, 0.63],
                    "text": "Artemis sends her regards",
                },
                "AWP | Mortis": {
                    "floatrange": [0, 0.64],
                    "text": "Every end is a new beginning",
                },
                "USP-S | Cortex": {
                    "floatrange": [0, 1],
                    "text": "Keep your head",
                },
            },
            "Covert": {
                "M4A4 | Neo-Noir": {
                    "floatrange": [0, 0.9],
                    "text": "«She grabbed what she could and disappeared into a decaying dystopia»",
                },
                "MP7 | Bloodsport": {
                    "floatrange": [0, 0.65],
                    "text": "Space for rent",
                },
            },
        },
        "Falchion Case": {
            "Aliases": ["фальшион", "бладхаунд"],
            "Mil-Spec": {
                "UMP-45 | Riot": {
                    "floatrange": [0, 0.7],
                    "text": "If you didn't want collateral damage, perhaps you should have been more specific... - Javier Alviso, Fist of the Phoenix",
                },
                "Nova | Ranger": {
                    "floatrange": [0, 1],
                    "text": "Who's keeping score?",
                },
                "Glock-18 | Bunsen Burner": {
                    "floatrange": [0, 0.8],
                    "text": "KNOCK KNOCK",
                },
                "P90 | Elite Build": {
                    "floatrange": [0, 1],
                    "text": "Tread softly Naomi...people in your line of work aren't known for their longevity - The Shield and The Serpent Part 2",
                },
                "USP-S | Torque": {
                    "floatrange": [0, 0.46],
                    "text": "They're manipulating you Kotaro. And if you can't see that, you're in more trouble than you know... - Felix Riley, Commanding Officer",
                },
                "Galil AR | Rocket Pop": {
                    "floatrange": [0, 1],
                    "text": "The perfect thing for a hot summer's day",
                },
            },
            "Restricted": {
                "FAMAS | Neural Net": {
                    "floatrange": [0, 0.6],
                    "text": "I know. But it was the right thing to do... - A Family Affair Part 2",
                },
                "P2000 | Handgun": {
                    "floatrange": [0, 1],
                    "text": "No more fun and games",
                },
                "MP9 | Ruby Poison Dart": {
                    "floatrange": [0, 0.5],
                    "text": "Who says diamonds are a girl's best friend?",
                },
                "Negev | Loudmouth": {
                    "floatrange": [0.14, 0.65],
                    "text": "Get back here, I'm talking to you!",
                },
                "M4A4 | Evil Daimyo": {
                    "floatrange": [0, 0.52],
                    "text": "Carmen. I found him...- The Oni and The Valkyrie Part 1",
                },
            },
            "Classified": {
                "CZ75-Auto | Yellow Jacket": {
                    "floatrange": [0, 1],
                    "text": "Float like a butterfly, sting like a relentless hateful insect",
                },
                "MP7 | Nemesis": {
                    "floatrange": [0, 0.32],
                    "text": "It's coming for you",
                },
                "SG 553 | Cyrex": {
                    "floatrange": [0, 1],
                    "text": "Sebastien is coming for me Valeria... we don't have much time - Chase Turner, Coalition Defector",
                },
            },
            "Covert": {
                "AWP | Hyper Beast": {
                    "floatrange": [0, 1],
                    "text": "You really want to impress me Booth? Make this black light sensitive - Rona Sabri, Rising Star",
                },
                "AK-47 | Aquamarine Revenge": {
                    "floatrange": [0, 1],
                    "text": "Is there an echo in here?",
                },
            },
            "Special": {
                "Falchion Knife | Slaughter": {
                    "floatrange": [0.01, 0.26],
                    "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
                },
                "Falchion Knife": {
                    "floatrange": [0, 1],
                    "text": "Vanilla",
                },
                "Falchion Knife | Blue Steel": {
                    "floatrange": [0, 1],
                    "text": "This is the malbec of weapon design - Booth, Arms Dealer",
                },
                "Falchion Knife | Crimson Web": {
                    "floatrange": [0.06, 0.8],
                    "text": "Be careful where you walk, you never know where the web is spread",
                },
                "Falchion Knife | Case Hardened": {
                    "floatrange": [0, 1],
                    "text": "A little color never hurt anyone",
                },
                "Falchion Knife | Night": {
                    "floatrange": [0.06, 0.8],
                    "text": "It's the whisper of the wind... it's the bite at your neck",
                },
                "Falchion Knife | Stained": {
                    "floatrange": [0, 1],
                    "text": "If you think it's messy now, wait until you see it under a blacklight",
                },
                "Falchion Knife | Forest DDPAT": {
                    "floatrange": [0.06, 0.8],
                    "text": "By the time you're close enough to notice the pixels it's already too late",
                },
                "Falchion Knife | Boreal Forest": {
                    "floatrange": [0.06, 0.8],
                    "text": "The woods can be a dangerous place... never travel alone",
                },
                "Falchion Knife | Safari Mesh": {
                    "floatrange": [0.06, 0.8],
                    "text": "A predator is a predator, no matter the environment",
                },
                "Falchion Knife | Urban Masked": {
                    "floatrange": [0.06, 0.8],
                    "text": "True power is demonstrated with subtle application",
                },
                "Falchion Knife | Scorched": {
                    "floatrange": [0.06, 0.8],
                    "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
                },
                "Falchion Knife | Fade": {
                    "floatrange": [0, 0.08],
                    "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
                },
            },
        },
        "Operation Phoenix Weapon Case": {
            "Aliases": ["феникс", "phoenix"],
            "Mil-Spec": {
                "MAG-7 | Heaven Guard": {
                    "floatrange": [0, 4],
                    "text": "Sometimes the wings of an angel don't mean salvation",
                },
                "UMP-45 | Corporal": {
                    "floatrange": [0.05, 0.75],
                    "text": "Respect can never be taken, only earned",
                },
                "Negev | Terrain": {
                    "floatrange": [0, 0.45],
                    "text": "For someone who is supposed to be impartial, your daughter made an interesting choice for companionship - The Father and The Phoenix Part 1",
                },
                "Tec-9 | Sandstorm": {
                    "floatrange": [0.1, 0.7],
                    "text": "It'll take more than a tarp to protect you",
                },
            },            
            "Restricted": {
                "SG 553 | Pulse": {
                    "floatrange": [0.1, 0.6],
                    "text": "Striking colors for a striking weapon",
                },
                "FAMAS | Sergeant": {
                    "floatrange": [0.1, 1],
                    "text": "Lead by example",
                },
                "MAC-10 | Heat": {
                    "floatrange": [0, 1],
                    "text": "Make some outlines of your own",
                },
                "USP-S | Guardian": {
                    "floatrange": [0, 0.38],
                    "text": "I can follow procedure and get 7 out, or I can do it my way and save all 10... your choice - Carmen Cocinero, Extraction Expert",
                },
            },
            "Classified": {
                "P90 | Trigon": {
                    "floatrange": [0.08, 0.75],
                    "text": "Become a human typhoon",
                },
                "Nova | Antique": {
                    "floatrange": [0, 0.3],
                    "text": "With age comes wisdom and stopping power",
                },
                "AK-47 | Redline": {
                    "floatrange": [0.1, 0.7],
                    "text": "Never be afraid to push it to the limit",
                },
            },
            "Covert": {
                "AWP | Asiimov": {
                    "floatrange": [0.18, 1],
                    "text": "Anyone can predict the future... a visionary shapes it",
                },
                "AUG | Chameleon": {
                    "floatrange": [0, 0.5],
                    "text": "Subtlety can make all the difference",
                },
            },
        },
        "Operation Wildfire Case": {
            "Aliases": ["дикое пламя", "боуи"],
            "Mil-Spec": {
                "Tec-9 | Jambiya": {
                    "floatrange": [0, 1],
                    "text": "Shahrazad told 1000 tales... this is the last one you'll hear",
                },
                "MAC-10 | Lapis Gator": {
                    "floatrange": [0, 0.5],
                    "text": "Airboat not included",
                },
                "Dual Berettas | Cartel": {
                    "floatrange": [0, 1],
                    "text": "That's why Huxley is doing the heavy lifting, all we have to is nudge her forward... - The Serpent and The Truth Seeker, Part 2",
                },
                "PP-Bizon | Photic Zone": {
                    "floatrange": [0, 1],
                    "text": "That's not crashing waves you hear...",
                },
                "SSG 08 | Necropos": {
                    "floatrange": [0, 1],
                    "text": "Every carpenter needs their hammer, every tailor their spindle...",
                },
                "USP-S | Lead Conduit": {
                    "floatrange": [0, 1],
                    "text": "You got what you wanted, now do you know what that means? – Booth, Arms Dealer",
                },
            },
            "Restricted": {
                "Five-SeveN | Triumvirate": {
                    "floatrange": [0, 0.61],
                    "text": "I don't profit from war, I profit from the human condition... - Booth, Arms Dealer",
                },
                "MAG-7 | Praetorian": {
                    "floatrange": [0, 0.45],
                    "text": "The spire is forming",
                },
                "MP7 | Impire": {
                    "floatrange": [0, 0.4],
                    "text": "Decimation has never been so adorable",
                },
                "Glock-18 | Royal Legion": {
                    "floatrange": [0, 1],
                    "text": "Naomi understands that one day she will die for Valeria",
                },
                "FAMAS | Valence": {
                    "floatrange": [0, 0.8],
                    "text": "We're always stronger together",
                },
            },
            "Classified": {
                "Nova | Hyper Beast": {
                    "floatrange": [0, 0.6],
                    "text": "They call you The Oni, right? Such a scary name for such a sad man... – Elliot Kingsman, Mercenary",
                },
                "AWP | Elite Build": {
                    "floatrange": [0, 1],
                    "text": "Chase Turner was a great man... you have big shoes to fill – The Phoenix and The Initiate, Part 1",
                },
                "Desert Eagle | Kumicho Dragon": {
                    "floatrange": [0, 0.76],
                    "text": "I'm a big fan of your work Yukako, we should talk... -Huxley, The Competition",
                },
            },
            "Covert": {
                "AK-47 | Fuel Injector": {
                    "floatrange": [0, 1],
                    "text": "Live your life a quarter mag at a time",
                },
                "M4A4 | The Battlestar": {
                    "floatrange": [0, 0.64],
                    "text": "Beware those who speak of the watchtower",
                },
            },
            "Special": {
                "Bowie Knife | Slaughter": {
                    "floatrange": [0.01, 0.26],
                    "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
                },
                "Bowie Knife": {
                    "floatrange": [0, 1],
                    "text": "Vanilla",
                },
                "Bowie Knife | Blue Steel": {
                    "floatrange": [0, 1],
                    "text": "This is the malbec of weapon design - Booth, Arms Dealer",
                },
                "Bowie Knife | Crimson Web": {
                    "floatrange": [0.06, 0.8],
                    "text": "Be careful where you walk, you never know where the web is spread",
                },
                "Bowie Knife | Case Hardened": {
                    "floatrange": [0, 1],
                    "text": "A little color never hurt anyone",
                },
                "Bowie Knife | Night": {
                    "floatrange": [0.06, 0.8],
                    "text": "It's the whisper of the wind... it's the bite at your neck",
                },
                "Bowie Knife | Stained": {
                    "floatrange": [0, 1],
                    "text": "If you think it's messy now, wait until you see it under a blacklight",
                },
                "Bowie Knife | Forest DDPAT": {
                    "floatrange": [0.06, 0.8],
                    "text": "By the time you're close enough to notice the pixels it's already too late",
                },
                "Bowie Knife | Boreal Forest": {
                    "floatrange": [0.06, 0.8],
                    "text": "The woods can be a dangerous place... never travel alone",
                },
                "Bowie Knife | Safari Mesh": {
                    "floatrange": [0.06, 0.8],
                    "text": "A predator is a predator, no matter the environment",
                },
                "Bowie Knife | Urban Masked": {
                    "floatrange": [0.06, 0.8],
                    "text": "True power is demonstrated with subtle application",
                },
                "Bowie Knife | Scorched": {
                    "floatrange": [0.06, 0.8],
                    "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
                },
                "Bowie Knife | Fade": {
                    "floatrange": [0, 0.08],
                    "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
                },
            },
        },
        "Shattered Web Case": {
            "Aliases": ["расколотая", "шаттер"],
            "Mil-Spec": {
                "Dual Berettas | Balance": {
                    "floatrange": [0, 1],
                    "text": "In all things",
                },
                "R8 Revolver | Memento": {
                    "floatrange": [0, 0.8],
                    "text": "Giddy up!",
                },
                "SCAR-20 | Torn": {
                    "floatrange": [0, 0.45],
                    "text": "To shreds...",
                },
                "MP5-SD | Acid Wash": {
                    "floatrange": [0, 0.68],
                    "text": "Black and blue and brass all over",
                },
                "Nova | Plume": {
                    "floatrange": [0, 0.8],
                    "text": "This oughta ruffle some feathers",
                },
                "M249 | Warbird": {
                    "floatrange": [0.05, 0.65],
                    "text": "This old bird deserves a rest",
                },
                "G3SG1 | Black Sand": {
                    "floatrange": [0, 0.8],
                    "text": "The Coalition Taskforce was winning, so Mikah turned to a more... aggressive approach",
                },
            },
            "Restricted": {
                "AK-47 | Rat Rod": {
                    "floatrange": [0, 1],
                    "text": "Nowhere to run",
                },
                "AUG | Arctic Wolf": {
                    "floatrange": [0, 0.7],
                    "text": "Every round is a 1v5",
                },
                "MP7 | Neon Ply": {
                    "floatrange": [0, 1],
                    "text": "Roy G. Biv? Never heard of 'em.",
                },
                "P2000 | Obsidian": {
                    "floatrange": [0, 1],
                    "text": "Giving the term «glass cannon» a whole new meaning",
                },
                "PP-Bizon | Embargo": {
                    "floatrange": [0, 1],
                    "text": "¡Chao pescao!",
                },
            },
            "Classified": {
                "SSG 08 | Bloodshot": {
                    "floatrange": [0.14, 0.60],
                    "text": "All the better to see you with",
                },
                "Tec-9 | Decimator": {
                    "floatrange": [0, 0.75],
                    "text": "Available for 4 easy payments of $124.95!",
                },
                "SG 553 | Colony IV": {
                    "floatrange": [0, 1],
                    "text": "Become a part of their world",
                },
            },
            "Covert": {
                "AWP | Containment Breach": {
                    "floatrange": [0, 1],
                    "text": "Who knows what radioactive diseases they carry…",
                },
                "MAC-10 | Stalker": {
                    "floatrange": [0, 1],
                    "text": "Here kitty, kitty...",
                },
            },
        },
        "Glove Case": {
            "Aliases": ["перчаточный", "глов"],
            "Mil-Spec": {
                "CZ75-Auto | Polymer": {
                    "floatrange": [0, 0.5],
                    "text": "You're not dealing with The Phoenix anymore, we know how to take care of our own... - The Daughter and the Paladin Part 2",
                },
                "MAG-7 | Sonar": {
                    "floatrange": [0, 0.45],
                    "text": "You're right, losing is a new experience for me – The Oni and The Valkyrie Part 2",
                },
                "MP9 | Sand Scale": {
                    "floatrange": [0, 0.45],
                    "text": "We must prepare for retaliation - Felix Riley, Commanding Officer",
                },
                "P2000 | Turf": {
                    "floatrange": [0, 1],
                    "text": "The grass is always redder on the opposing side",
                },
                "Galil AR | Black Sand": {
                    "floatrange": [0, 1],
                    "text": "Mikah Baton is about to begin his campaign against the Coalition Taskforce",
                },
                "MP7 | Cirrus": {
                    "floatrange": [0, 0.75],
                    "text": "Get your head out of the clouds",
                },
                "Glock-18 | Ironwork": {
                    "floatrange": [0, 1],
                    "text": "Left unchecked, any garden becomes a tangled mass of weeds",
                },
            },
            "Restricted": {
                "G3SG1 | Stinger": {
                    "floatrange": [0, 0.7],
                    "text": "A moment of pain. Then nothing.",
                },
                "Nova | Gila": {
                    "floatrange": [0, 0.3],
                    "text": "You're acting like you've never been held captive by mercenaries before – The Oni and The Valkyrie Part 1",
                },
                "Dual Berettas | Royal Consorts": {
                    "floatrange": [0, 1],
                    "text": "Face off and release the doves",
                },
                "M4A1-S | Flashback": {
                    "floatrange": [0, 1],
                    "text": "For the joker in all of us",
                },
                "USP-S | Cyrex": {
                    "floatrange": [0, 0.55],
                    "text": "Imogen was the past Felix, I'm the future - Huxley, The Competition",
                },
            },
            "Classified": {
                "Sawed-Off | Wasteland Princess": {
                    "floatrange": [0, 0.7],
                    "text": "A perfect gift for the sociopath that has everything...",
                },
                "P90 | Shallow Grave": {
                    "floatrange": [0, 0.75],
                    "text": "With the amount of bodies you're racking up, who has time to dig?",
                },
                "FAMAS | Mecha Industries": {
                    "floatrange": [0, 0.5],
                    "text": "Spikey blue hair and robot companion not included",
                },
            },
            "Covert": {
                "M4A4 | Buzz Kill": {
                    "floatrange": [0, 0.7],
                    "text": "There's one at every party",
                },
                "SSG 08 | Dragonfire": {
                    "floatrange": [0, 0.5],
                    "text": "Sit on your horde and wait for any who come to take it",
                },
            },
        },
        "Shadow Case": {
            "Aliases": ["shadow", "шадоу", "шедоу", "тёмный", "темный"],
            "Mil-Spec": {
                "MAG-7 | Cobalt Core": {
                    "floatrange": [0, 0.5],
                    "text": "Keep him safe, Carmen - The Valkyrie and The Paramour Part 1",
                },
                "XM1014 | Scumbria": {
                    "floatrange": [0, 1],
                    "text": "Let's not be hasty: there may be another way to get Valeria's attention... - A Father's Love Part 3",
                },
                "MAC-10 | Rangeen": {
                    "floatrange": [0, 0.5],
                    "text": "Can you stand against it's wrathful gaze?",
                },
                "FAMAS | Survivor Z": {
                    "floatrange": [0, 0.6],
                    "text": "What's red and white and fires full auto?",
                },
                "Glock-18 | Wraiths": {
                    "floatrange": [0, 0.8],
                    "text": "First it pierces the shroud, then it pierces the shadow",
                },
                "SCAR-20 | Green Marine": {
                    "floatrange": [0, 0.8],
                    "text": "Listen up people... Izaki and Cocinero may be AWOL, but our mission remains the same: we're saving Alex Kincaide - Felix Riley, Commanding Officer",
                },
                "Dual Berettas | Dualing Dragons": {
                    "floatrange": [0, 1],
                    "text": "Marian was always cooler than Sylvia",
                },
            },
            "Restricted": {
                "MP7 | Special Delivery": {
                    "floatrange": [0, 0.62],
                    "text": "If I do what you want, will you let me go? - The Phoenix and The Storyteller Part 2",
                },
                "M249 | Nebula Crusader": {
                    "floatrange": [0, 1],
                    "text": "You can use it, but you better put up a quarter first",
                },
                "P250 | Wingshot": {
                    "floatrange": [0, 0.9],
                    "text": "Sometimes a subtle nudge is all it takes to get what you want - Franz Kriegeld, Phoenix Tactician",
                },
                "Galil AR | Stone Cold": {
                    "floatrange": [0, 0.9],
                    "text": "Eventually you need to step outside of your mentor's shadow",
                },
            },
            "Classified": {
                "SSG 08 | Big Iron": {
                    "floatrange": [0, 0.64],
                    "text": "A win with an asterisk is still a win - Rona Sabri, Rising Star",
                },
                "G3SG1 | Flux": {
                    "floatrange": [0, 0.9],
                    "text": "A plan is a list of things that don't happen",
                },
                "AK-47 | Frontside Misty": {
                    "floatrange": [0.02, 0.87],
                    "text": "I like to work in the snow... it always leaves a pretty picture - Javier Alviso, Fist of the Phoenix",
                },
            },
            "Covert": {
                "USP-S | Kill Confirmed": {
                    "floatrange": [0, 1],
                    "text": "2 in the chest, 1 in the head",
                },
                "M4A1-S | Golden Coil": {
                    "floatrange": [0, 1],
                    "text": "The viper can strike from anywhere",
                },
            },
            "Special": {
                "Shadow Daggers | Slaughter": {
                    "floatrange": [0.01, 0.26],
                    "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
                },
                "Shadow Daggers": {
                    "floatrange": [0, 1],
                    "text": "Vanilla",
                },
                "Shadow Daggers | Blue Steel": {
                    "floatrange": [0, 1],
                    "text": "This is the malbec of weapon design - Booth, Arms Dealer",
                },
                "Shadow Daggers | Crimson Web": {
                    "floatrange": [0.06, 0.8],
                    "text": "Be careful where you walk, you never know where the web is spread",
                },
                "Shadow Daggers | Case Hardened": {
                    "floatrange": [0, 1],
                    "text": "A little color never hurt anyone",
                },
                "Shadow Daggers | Night": {
                    "floatrange": [0.06, 0.8],
                    "text": "It's the whisper of the wind... it's the bite at your neck",
                },
                "Shadow Daggers | Stained": {
                    "floatrange": [0, 1],
                    "text": "If you think it's messy now, wait until you see it under a blacklight",
                },
                "Shadow Daggers | Forest DDPAT": {
                    "floatrange": [0.06, 0.8],
                    "text": "By the time you're close enough to notice the pixels it's already too late",
                },
                "Shadow Daggers | Boreal Forest": {
                    "floatrange": [0.06, 0.8],
                    "text": "The woods can be a dangerous place... never travel alone",
                },
                "Shadow Daggers | Safari Mesh": {
                    "floatrange": [0.06, 0.8],
                    "text": "A predator is a predator, no matter the environment",
                },
                "Shadow Daggers | Urban Masked": {
                    "floatrange": [0.06, 0.8],
                    "text": "True power is demonstrated with subtle application",
                },
                "Shadow Daggers | Scorched": {
                    "floatrange": [0.06, 0.8],
                    "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
                },
                "Shadow Daggers | Fade": {
                    "floatrange": [0, 0.08],
                    "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
                },
            },
        },
        "Prisma 2 Case": {
            "Aliases": ["prisma 2", "призма 2"],
            "Mil-Spec": {
                "R8 Revolver | Bone Forged": {
                    "floatrange": [0, 0.6],
                    "text": "What lurks below",
                },
                "Negev | Prototype": {
                    "floatrange": [0, 0.7],
                    "text": "v1.2.1, PAT. 3422107",
                },
                "CZ75-Auto | Distressed": {
                    "floatrange": [0, 1],
                    "text": "Better with age",
                },
                "MP5-SD | Desert Strike": {
                    "floatrange": [0, 1],
                    "text": "Strike first, strike last",
                },
                "AWP | Capillary": {
                    "floatrange": [0.05, 0.7],
                    "text": "The key to an agent's heart costs $4750",
                },
                "Desert Eagle | Blue Ply": {
                    "floatrange": [0, 1],
                    "text": "WARNING: This is a replica and has not been tested with live ammunition",
                },
                "AUG | Tom Cat": {
                    "floatrange": [0, 0.8],
                    "text": "Thunderstorms are nature's purr",
                },
            },
            "Restricted": {
                "SG 553 | Darkwing": {
                    "floatrange": [0, 1],
                    "text": "Eagle eyed and extremely lethal; you won't find a more dangerous flightless bird",
                },
                "SSG 08 | Fever Dream": {
                    "floatrange": [0, 0.72],
                    "text": "H@@HH@H@H@HA!!",
                },
                "Sawed-Off | Apocalypto": {
                    "floatrange": [0, 1],
                    "text": "Have you got the time?",
                },
                "SCAR-20 | Enforcer": {
                    "floatrange": [0, 1],
                    "text": "Automatic solutions from SYMETRY SMART GUN CORP",
                },
                "P2000 | Acid Etched": {
                    "floatrange": [0, 1],
                    "text": "Do you feel lucky?",
                },
            },
            "Classified": {
                "AK-47 | Phantom Disruptor": {
                    "floatrange": [0, 0.65],
                    "text": "«It can be whatever it wants, wherever it wants, and yet it chooses to reside with you…»",
                },
                "MAC-10 | Disco Tech": {
                    "floatrange": [0, 1],
                    "text": "Watch when you point that thing",
                },
                "MAG-7 | Justice": {
                    "floatrange": [0, 1],
                    "text": "Judgement for all",
                },
            },
            "Covert": {
                "Glock-18 | Bullet Queen": {
                    "floatrange": [0, 1],
                    "text": "«I'll stop shooting when you start shushing»",
                },
                "M4A1-S | Player Two": {
                    "floatrange": [0, 0.84],
                    "text": "Press Start...",
                },
            },
        },
        "Prisma Case": {
            "Aliases": ["prisma", "призма"],
            "Mil-Spec": {
                "MP7 | Mischief": {
                    "floatrange": [0.1, 1],
                    "text": "Up to no good",
                },
                "P90 | Off World": {
                    "floatrange": [0, 0.75],
                    "text": "This topcoat may never dry…",
                },
                "P250 | Verdigris": {
                    "floatrange": [0, 0.7],
                    "text": "From the air you breathe",
                },
                "FAMAS | Crypsis": {
                    "floatrange": [0, 0.55],
                    "text": "Take a second look",
                },
                "Galil AR | Akoben": {
                    "floatrange": [0, 1],
                    "text": "Catch and decease",
                },
                "AK-47 | Uncharted": {
                    "floatrange": [0, 0.75],
                    "text": "We share the same canoe",
                },
            },
            "Restricted": {
                "MP5-SD | Gauss": {
                    "floatrange": [0, 1],
                    "text": "Lovingly referred to as the «SpaceGat 2000»",
                },
                "Tec-9 | Bamboozle": {
                    "floatrange": [0, 0.8],
                    "text": "Don't be deceived",
                },
                "UMP-45 | Moonrise": {
                    "floatrange": [0, 0.4],
                    "text": "Look for the North Star",
                },
                "Desert Eagle | Light Rail": {
                    "floatrange": [0, 0.9],
                    "text": "Required power supply sold separately",
                },
                "AWP | Atheris": {
                    "floatrange": [0, 1],
                    "text": "As deadly as it is beautiful",
                },
            },
            "Classified": {
                "R8 Revolver | Skull Crusher": {
                    "floatrange": [0.25, 0.8],
                    "text": "«Open wiiiiide»",
                },
                "XM1014 | Incinegator": {
                    "floatrange": [0.14, 0.65],
                    "text": "Boom. Bam. Bop... Pow.",
                },
                "AUG | Momentum": {
                    "floatrange": [0.05, 1],
                    "text": "Always moving forward",
                },
            },
            "Covert": {
                "M4A4 | The Emperor": {
                    "floatrange": [0, 0.8],
                    "text": "Lead with your head, even if it means ignoring your heart",
                },
                "Five-SeveN | Angry Mob": {
                    "floatrange": [0, 0.7],
                    "text": "«Inside voices, please»",
                },
            },
        },
        "CS20 Case": {
            "Aliases": ["cs20", "кс20"],
            "Mil-Spec": {
                "SCAR-20 | Assault": {
                    "floatrange": [0, 0.62],
                    "text": "Also available in red",
                },
                "Tec-9 | Flash Out": {
                    "floatrange": [0, 0.7],
                    "text": "Re: Dance lessons with Jordan",
                },
                "Dual Berettas | Elite 1.6": {
                    "floatrange": [0, 0.7],
                    "text": "Source material",
                },
                "MAG-7 | Popdog": {
                    "floatrange": [0, 0.8],
                    "text": "The dog that refreshes!",
                },
                "MAC-10 | Classic Crate": {
                    "floatrange": [0, 1],
                    "text": "Rush B, don't stop",
                },
                "FAMAS | Decommissioned": {
                    "floatrange": [0, 1],
                    "text": "If found please return to Cedar Creek Nuclear Power Plant",
                },
                "Glock-18 | Sacrifice": {
                    "floatrange": [0, 1],
                    "text": "«The defuse is coming in—he's still going!»",
                },
            },
            "Restricted": {
                "M249 | Aztec": {
                    "floatrange": [0, 0.75],
                    "text": "Never trust a rope bridge",
                },
                "Five-SeveN | Buddy": {
                    "floatrange": [0, 0.55],
                    "text": "I've got your six",
                },
                "UMP-45 | Plastique": {
                    "floatrange": [0, 0.8],
                    "text": "73556**",
                },
                "P250 | Inferno": {
                    "floatrange": [0, 0.68],
                    "text": "«But look at the time!»",
                },
                "MP5-SD | Agent": {
                    "floatrange": [0, 1],
                    "text": "«It's time to earn our stories»",
                },
            },
            "Classified": {
                "P90 | Nostalgia": {
                    "floatrange": [0, 0.57],
                    "text": "Minutes to install but a lifetime to master",
                },
                "MP9 | Hydra": {
                    "floatrange": [0, 1],
                    "text": "Worth the wait",
                },
                "AUG | Death by Puppy": {
                    "floatrange": [0, 0.4],
                    "text": "Not to be confused with «ladder»",
                },
            },
            "Covert": {
                "FAMAS | Commemoration": {
                    "floatrange": [0, 0.5],
                    "text": "Here's to 20 more",
                },
                "AWP | Wildfire": {
                    "floatrange": [0.01, 0.7],
                    "text": "The nail that sticks out gets the hammer",
                },
            },
            "Special": {
                "Classic Knife | Slaughter": {
                    "floatrange": [0.01, 0.26],
                    "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
                },
                "Classic Knife": {
                    "floatrange": [0, 1],
                    "text": "Vanilla",
                },
                "Classic Knife | Blue Steel": {
                    "floatrange": [0, 1],
                    "text": "This is the malbec of weapon design - Booth, Arms Dealer",
                },
                "Classic Knife | Crimson Web": {
                    "floatrange": [0.06, 0.8],
                    "text": "Be careful where you walk, you never know where the web is spread",
                },
                "Classic Knife | Case Hardened": {
                    "floatrange": [0, 1],
                    "text": "A little color never hurt anyone",
                },
                "Classic Knife | Night Stripe": {
                    "floatrange": [0.06, 0.8],
                    "text": "Spray... Pray... Paint... Stab.",
                },
                "Classic Knife | Stained": {
                    "floatrange": [0, 1],
                    "text": "If you think it's messy now, wait until you see it under a blacklight",
                },
                "Classic Knife | Forest DDPAT": {
                    "floatrange": [0.06, 0.8],
                    "text": "By the time you're close enough to notice the pixels it's already too late",
                },
                "Classic Knife | Boreal Forest": {
                    "floatrange": [0.06, 0.8],
                    "text": "The woods can be a dangerous place... never travel alone",
                },
                "Classic Knife | Safari Mesh": {
                    "floatrange": [0.06, 0.8],
                    "text": "A predator is a predator, no matter the environment",
                },
                "Classic Knife | Urban Masked": {
                    "floatrange": [0.06, 0.8],
                    "text": "True power is demonstrated with subtle application",
                },
                "Classic Knife | Scorched": {
                    "floatrange": [0.06, 0.8],
                    "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
                },
                "Classic Knife | Fade": {
                    "floatrange": [0, 0.08],
                    "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
                },
            },
        },
        "Operation Broken Fang Case": {
            "Aliases": ["сломанный клык", "брокенфанг", "брокен фанг", "broken fang"],
            "Mil-Spec": {
                "MP5-SD | Condition Zero": {
                    "floatrange": [0, 1],
                    "text": "«RPG from three o'clock! Evade!»",
                },
                "Galil AR | Vandal": {
                    "floatrange": [0, 1],
                    "text": "Each drawing tells a story, some more memorable than others",
                },
                "P250 | Contaminant": {
                    "floatrange": [0, 0.7],
                    "text": "It's only as bad as it looks",
                },
                "P90 | Cocoa Rampage": {
                    "floatrange": [0, 0.6],
                    "text": "Dinosaurs and aliens and comets, oh my!",
                },
                "CZ75-Auto | Vendetta": {
                    "floatrange": [0, 1],
                    "text": "From my cold, dead hands",
                },
                "M249 | Deep Relief": {
                    "floatrange": [0, 1],
                    "text": "How many bullets to get to the center?",
                },
            },
            "Restricted": {
                "AWP | Exoskeleton": {
                    "floatrange": [0, 1],
                    "text": "Full tilt",
                },
                "SSG 08 | Parallax": {
                    "floatrange": [0, 1],
                    "text": "Shoot twice, kill once",
                },
                "Nova | Clear Polymer": {
                    "floatrange": [0, 1],
                    "text": "Your goals are clear",
                },
                "UMP-45 | Gold Bismuth": {
                    "floatrange": [0, 0.7],
                    "text": "«You have expensive taste…»",
                },
                "Dual Berettas | Dezastre": {
                    "floatrange": [0, 1],
                    "text": "Always follow manufacturer guidelines for safe use",
                },
            },
            "Classified": {
                "Five-SeveN | Fairy Tale": {
                    "floatrange": [0.02, 0.9],
                    "text": "«Today's gonna be a good day—I can just feel it»",
                },
                "USP-S | Monster Mashup": {
                    "floatrange": [0, 0.7],
                    "text": "X__X",
                },
                "M4A4 | Cyber Security": {
                    "floatrange": [0, 0.98],
                    "text": "AVAILABLE NOW AT YOUR LOCAL CYBERNETICS RETAILER",
                },
            },
            "Covert": {
                "M4A1-S | Printstream": {
                    "floatrange": [0, 0.8],
                    "text": "WHITE_1; BLACK_1; PEARLESCENT_1; SILENCED_1;",
                },
                "Glock-18 | Neo-Noir": {
                    "floatrange": [0, 1],
                    "text": "Things were starting to turn and she began to feel hope—then she looked up",
                },
            },
        },
        "Snakebite Case": {
            "Aliases": ["снейкбайт", "snakebite", "змеиный"],
            "Mil-Spec": {
                "Nova | Windblown": {
                    "floatrange": [0, 0.5],
                    "text": "Get off my lawn",
                },
                "M249 | O.S.I.P.R.": {
                    "floatrange": [0, 0.7],
                    "text": "Overwatch Standard Issue Pulse Rifle",
                },
                "UMP-45 | Oscillator": {
                    "floatrange": [0, 0.5],
                    "text": "Everyone has a breaking point; where's yours?",
                },
                "CZ75-Auto | Circaetus": {
                    "floatrange": [0, 0.9],
                    "text": "A snake eater, minus the catchy theme song",
                },
                "R8 Revolver | Junk Yard": {
                    "floatrange": [0, 1],
                    "text": "Fit for a king",
                },
                "SG 553 | Heavy Metal": {
                    "floatrange": [0, 1],
                    "text": "«One of these studs is the Turbo button, I just can't remember which…»",
                },
                "Glock-18 | Clear Polymer": {
                    "floatrange": [0, 1],
                    "text": "What you see is what you get",
                },
            },
            "Restricted": {
                "Negev | dev_texture": {
                    "floatrange": [0, 0.65],
                    "text": "hammer.exe time",
                },
                "MAC-10 | Button Masher": {
                    "floatrange": [0, 1],
                    "text": "Giving the phrase «console wars» a whole new meaning",
                },
                "P250 | Cyber Shell": {
                    "floatrange": [0, 0.85],
                    "text": "You represent the front line of our cyber security effort",
                },
                "AK-47 | Slate": {
                    "floatrange": [0, 1],
                    "text": "«Call a doctor, they're gonna need one»",
                },
                "Desert Eagle | Trigger Discipline": {
                    "floatrange": [0, 0.97],
                    "text": "Patience is its own reward",
                },
            },
            "Classified": {
                "XM1014 | XOXO": {
                    "floatrange": [0.02, 0.9],
                    "text": "Yeah, right…",
                },
                "Galil AR | Chromatic Aberration": {
                    "floatrange": [0, 1],
                    "text": "(Not so) easy on the eyes...",
                },
                "MP9 | Food Chain": {
                    "floatrange": [0, 1],
                    "text": "Eat or be eaten",
                },
            },
            "Covert": {
                "USP-S | The Traitor": {
                    "floatrange": [0, 1],
                    "text": "Past failures are the blueprints for future success",
                },
                "M4A4 | In Living Color": {
                    "floatrange": [0, 0.79],
                    "text": "Fight for one, fight for all",
                },
            },
        },
        "Operation Breakout Weapon Case": {
            "Aliases": ["прорыв", "breakout", "брейкаут"],
            "Mil-Spec": {
                "UMP-45 | Labyrinth": {
                    "floatrange": [0, 0.4],
                    "text": "It has been painted with subtle orange linework.",
                },
                "Negev | Desert-Strike": {
                    "floatrange": [0, 0.5],
                    "text": "It has been custom painted with a high-tech design in tan and black.",
                },
                "P2000 | Ivory": {
                    "floatrange": [0, 1],
                    "text": "It has faux ivory parts.",
                },
                "MP7 | Urban Hazard": {
                    "floatrange": [0, 0.5],
                    "text": "It has been custom painted with urban camo and orange accents.",
                },
                "SSG 08 | Abyss": {
                    "floatrange": [0, 1],
                    "text": "It has been painted with a hydrographic in an oceanic pattern.",
                },
            },
            "Restricted": {
                "P250 | Supernova": {
                    "floatrange": [0, 0.4],
                    "text": "It has been painted with a hydrographic in a cosmic pattern with concentric circles.",
                },
                "Nova | Koi": {
                    "floatrange": [0, 0.3],
                    "text": "It has been custom painted with variegated koi scales.",
                },
                "PP-Bizon | Osiris": {
                    "floatrange": [0, 0.5],
                    "text": "It has been custom painted with a high-tech design in black, white, and amber.",
                },
                "CZ75-Auto | Tigris": {
                    "floatrange": [0, 1],
                    "text": "It has been custom painted with high-gloss paint in a tiger stripe motif.",
                },
            },
            "Classified": {
                "Five-SeveN | Fowl Play": {
                    "floatrange": [0, 1],
                    "text": "It has been painted with a pattern of falling feathers.",
                },
                "Desert Eagle | Conspiracy": {
                    "floatrange": [0, 0.3],
                    "text": "It has been painted with dark, metallic paint and pale yellow accents.",
                },
                "Glock-18 | Water Elemental": {
                    "floatrange": [0, 0.7],
                    "text": "It has been custom painted with the image of a creature made of water in a graphic style.  ",
                },
            },
            "Covert": {
                "P90 | Asiimov": {
                    "floatrange": [0, 0.92],
                    "text": "Anyone can predict the future... a visionary shapes it",
                },
                "M4A1-S | Cyrex": {
                    "floatrange": [0, 0.5],
                    "text": "It has been custom painted with a high-tech design in black, white, and red.",
                },
            },
            "Special": {
                "Butterfly Knife | Slaughter": {
                    "floatrange": [0.01, 0.26],
                    "text": "Valeria doesn't pay Javier to ask questions... she pays him to pry out answers",
                },
                "Butterfly Knife": {
                    "floatrange": [0, 1],
                    "text": "Vanilla",
                },
                "Butterfly Knife | Blue Steel": {
                    "floatrange": [0, 1],
                    "text": "This is the malbec of weapon design - Booth, Arms Dealer",
                },
                "Butterfly Knife | Crimson Web": {
                    "floatrange": [0.06, 0.8],
                    "text": "Be careful where you walk, you never know where the web is spread",
                },
                "Butterfly Knife | Case Hardened": {
                    "floatrange": [0, 1],
                    "text": "A little color never hurt anyone",
                },
                "Butterfly Knife | Night": {
                    "floatrange": [0.06, 0.8],
                    "text": "It's the whisper of the wind... it's the bite at your neck",
                },
                "Butterfly Knife | Stained": {
                    "floatrange": [0, 1],
                    "text": "If you think it's messy now, wait until you see it under a blacklight",
                },
                "Butterfly Knife | Forest DDPAT": {
                    "floatrange": [0.06, 0.8],
                    "text": "By the time you're close enough to notice the pixels it's already too late",
                },
                "Butterfly Knife | Boreal Forest": {
                    "floatrange": [0.06, 0.8],
                    "text": "The woods can be a dangerous place... never travel alone",
                },
                "Butterfly Knife | Safari Mesh": {
                    "floatrange": [0.06, 0.8],
                    "text": "A predator is a predator, no matter the environment",
                },
                "Butterfly Knife | Urban Masked": {
                    "floatrange": [0.06, 0.8],
                    "text": "True power is demonstrated with subtle application",
                },
                "Butterfly Knife | Scorched": {
                    "floatrange": [0.06, 0.8],
                    "text": "The Phoenix is not a symbol of destruction... it's a symbol of rebirth - Valeria Jenner, Revolutionary",
                },
                "Butterfly Knife | Fade": {
                    "floatrange": [0, 0.08],
                    "text": "This isn't just a weapon, it's a conversation piece - Imogen, Arms Dealer In Training",
                },
            },
        },
    },
    "Sticker Capsule 2": {
        "High Grade": {
            "Chicken Lover",
            "Let's Roll-oll",
            "Metal",
            "Bomb Code",
            "Banana",
            "Have Fun",
            "Good Game",
            "Good Luck",
            "Welcome to the Clutch",
            "Nice Shot",
        },
        "Remarkable": {
            "Let's Roll-oll",
            "Bash",
            "Bosh",
            "Bish",
        },
        "Exotic": {
            "Stupid Banana",
            "Crown",
        },
    },
    "2020 RMR": {
        "Challengers": [
            "Astralis",
            "Fnatic",
            "Nemiga",
            "GODSENT",
            "Liquid",
            "BIG",
            "OG",
            "G2",
        ],
        "Legends": [
            "FURIA",
            "Evil Geniuses",
            "Team Vitality",
            "Heroic",
            "Ninjas in Pyjamas",
            "Natus Vincere",
            "Team Spirit",
            "100 Thieves",
        ],
        "Contenders": [
            "ESPADA",
            "Virtus.Pro",
            "TYLOO",
            "Gen.G",
            "North",
            "Renegades",
            "FaZe",
            "Boom",
        ],
    },    
    "Stockholm 2021": {
        "Challengers": [
            "Astralis",
            "Team Spirit",
            "paiN Gaming",
            "ENCE",
            "Movistar Riders",
            "BIG",
            "Heroic",
            "MOUZ",
            "PGL"
        ],
        "Legends": [
            "FURIA",
            "Evil Geniuses",
            "Vitality",
            "G2 Esports",
            "Ninjas in Pyjamas",
            "Natus Vincere",
            "Team Liquid",
            "PGL",
        ],
        "Contenders": [
            "Sharks Esports",
            "Virtus.Pro",
            "TYLOO",
            "Renegades",
            "Entropiq",
            "GODSENT",
            "FaZe Clan",
            "Copenhagen Flames",
            "PGL",
        ],
    },
    "susCaught": [
        "Хах, пiймав на VAC!",
        "Ещё один отлетел!",
        "Кстати, тут ещё одного подлеца забанили.",
        "Ой, смотрите, кого не стало.",
        "Помянем.",
        "VACation!",
        "Это бан!",
        "Не, ну это тупо VAC!",
        "Домой!",
        "Накоец-то!",
        "А вы не верили!",
        "БАН!",
        "Ну неужто!",
        "Ой, отлетел.",
        "Наконец-то этому существу выписали VAC.",
        "ВАКцинируемся!",
        "Уехал в баню!",
        "На свалку истории!",
        "Петуч попался в ловушку для петучей!",
        "Был пацан и нет пацана...",
    ],
    "susadded" : [
        "Слежу!",
        "Будем наблюдать!",
        "Сообщу, как... его не станет.",
        "Считаю дни до бана.",
        "Я бы не ждала быстрого бана. VAC, всё-таки...",
        "Буду следить!",
        "Всё записала, сообщу, как отлетит!",
        "Эх, сломанная игра... Буду следить.",
        "Как забанят, доложу!",
        "Денно и нощно.",
        "Ваши ставки, через сколько недель забанят?",
        "Ещё один? Животные.",
        "Слежу, слежу.",
        "Думаю, время до бана — тотал больше 20 дней..",
        "Ждём месяцок, авось забанят...",
    ],
    "sus_already": [
        "Так вот же он!",
        "Так есть же уже такой!",
        "Хм... Он уже есть в списках подозреваемых.",
        "Так добавляли ж его уже, нет?",
        "Déjà vu...",
        "Уже отслеживаю!",
    ],
    "ChooserList": [
        "Как-то так.",
        "Вышло так.",
        "Пусть будет так.",
        "А давайте так?",
        "Это не подкрутка, честно.",
        "C'est la vie.",
        "Простите, если не оправдала ожиданий.",
        "Надеюсь, никого не расстроил ответ!",
        "...вы же помните, что это случайный выбор?",
        "...и это окончательно.",
        "Таков ответ.",
        "...но я бы не придавала этому особого значения.",
        "«Случайности не случайны»",
        "Демокрит считал, что вера в случайность следует из незнания первопричин...",
    ],
    "cards": {
        "players": {
            "s1mple": {
                "name": "Aleksandr Kostyliev",
                "tier": 1,
                "preferred role": "AWPer",
                "skills": {
                    "aim": 10,
                    "movement": 7,
                    "AWP": 10,
                    "rifle": 9,
                    "farmgun": 7,
                    "pistol": 9,
                    "clutch": 7,
                    "teamplay": 7,
                    "communication": 5,
                    "IGLing": 4,
                    "support": 5,
                },
            },      
            "karrigan": {
                "name": "Finn Andersen",
                "tier": 2,
                "preferred role": "IGL",
                "skills": {
                    "aim": 7,
                    "movement": 6,
                    "AWP": 7,
                    "rifle": 8,
                    "farmgun": 8,
                    "pistol": 9,
                    "clutch": 8,
                    "teamplay": 9,
                    "communication": 10,
                    "IGLing": 10,
                    "support": 8,
                },
            },      
            "Stewie2K": {
                "name": "Jake Yip",
                "tier": 3,
                "preferred role": "rifler",
                "skills": {
                    "aim": 7,
                    "movement": 8,
                    "AWP": 6,
                    "rifle": 7,
                    "farmgun": 8,
                    "pistol": 6,
                    "clutch": 7,
                    "teamplay": 8,
                    "communication": 7,
                    "IGLing": 5,
                    "support": 9,
                },
            },  
            "NiKo": {
                "name": "Nikola Kovač",
                "tier": 1,
                "preferred role": "rifler",
                "skills": {
                    "aim": 10,
                    "movement": 6,
                    "AWP": 8,
                    "rifle": 10,
                    "farmgun": 5,
                    "pistol": 9,
                    "clutch": 7,
                    "teamplay": 5,
                    "communication": 7,
                    "IGLing": 5,
                    "support": 4,
                },
            },  
            "Gratisfaction": {
                "name": "Sean Kaiwai",
                "tier": 4,
                "preferred role": "AWPer",
                "skills": {
                    "aim": 8,
                    "movement": 7,
                    "AWP": 7,
                    "rifle": 6,
                    "farmgun": 5,
                    "pistol": 6,
                    "clutch": 7,
                    "teamplay": 7,
                    "communication": 5,
                    "IGLing": 3,
                    "support": 3,
                },
            },      
            "rain": {
                "name": "Håvard Nygaard",
                "tier": 3,
                "preferred role": "rifler",
                "skills": {
                    "aim": 9,
                    "movement": 6,
                    "AWP": 5,
                    "rifle": 8,
                    "farmgun": 6,
                    "pistol": 7,
                    "clutch": 6,
                    "teamplay": 8,
                    "communication": 7,
                    "IGLing": 3,
                    "support": 7,
                },
            },      
            "huNter-": {
                "name": "Nemanja Kovač",
                "tier": 3,
                "preferred role": "rifler",
                "skills": {
                    "aim": 7,
                    "movement": 7,
                    "AWP": 6,
                    "rifle": 8,
                    "farmgun": 9,
                    "pistol": 8,
                    "clutch": 9,
                    "teamplay": 4,
                    "communication": 6,
                    "IGLing": 4,
                    "support": 4,
                },
            },      
            "coldzera": {
                "name": "Marcelo David",
                "tier": 2,
                "preferred role": "rifler",
                "skills": {
                    "aim": 9,
                    "movement": 8,
                    "AWP": 8,
                    "rifle": 9,
                    "farmgun": 6,
                    "pistol": 9,
                    "clutch": 8,
                    "teamplay": 5,
                    "communication": 6,
                    "IGLing": 7,
                    "support": 6,
                },
            },      
            "Perfecto": {
                "name": "Ilya Zalutskiy",
                "tier": 3,
                "preferred role": "rifler",
                "skills": {
                    "aim": 7,
                    "movement": 6,
                    "AWP": 7,
                    "rifle": 8,
                    "farmgun": 7,
                    "pistol": 8,
                    "clutch": 9,
                    "teamplay": 8,
                    "communication": 8,
                    "IGLing": 3,
                    "support": 10,
                },
            },      
            "Boombl4": {
                "name": "Kirill Mikhailov",
                "tier": 3,
                "preferred role": "IGL",
                "skills": {
                    "aim": 4,
                    "movement": 5,
                    "AWP": 4,
                    "rifle": 6,
                    "farmgun": 6,
                    "pistol": 7,
                    "clutch": 4,
                    "teamplay": 8,
                    "communication": 9,
                    "IGLing": 7,
                    "support": 7,
                }
            }
        },
        "coaches": {
            "B1ad3": {
                "name": "Andrey Gorodenskiy",
                "tier": 1,
                "skills": {
                    "timings": 6,
                    "preparation": 9,
                    "personal approach": 8,
                    "contextuality": 6,
                    "emotionality": 3,
                },
            },
            "XTQZZZ": {
                "name": "Rémy Quoniam",
                "tier": 1,
                "skills": {
                    "timings": 9,
                    "preparation": 8,
                    "personal approach": 6,
                    "contextuality": 9,
                    "emotionality": 9,
                }
            }
        }
    }
}